zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--LPRIF: Low Power IF Register -->
                <register>
                    <name>LPREIF</name>
                    <description>low power interrupt flag register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPREIF-->
                        <field>
                            <name>LPREIF</name>
                            <description>lprun error</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LPRUN_OK</name>
                                    <description>go into lprun mode ok</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPRUN_ERR</name>
                                    <description>go into lprun mode error</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SLPEIF-->
                        <field>
                            <name>SLPEIF</name>
                            <description>go into sleep mode error</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLEEP_OK</name>
                                    <description>go into sleep mode ok</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLEEP_ERR</name>
                                    <description>go into sleep mode error</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RTCBKPEIF-->
                        <field>
                            <name>RTCBKPEIF</name>
                            <description>go into RTCBKP mode error flag</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RTCBKP_OK</name>
                                    <description>go into RTCBKP mode ok</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCBKP_ERR</name>
                                    <description>go into RTCBKP mode error</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--RCC-->
        <peripheral>
            <name>RCC</name>
            <description>RESET AND CLOCK CONTROL UNIT</description>
            <groupName>RCC</groupName>
            <baseAddress>0x40000200</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x200</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDT</name>
                <value>0</value>
            </interrupt>
            <registers>
                <!--RSTCFG: RESET Config Register-->
                <register>
                    <name>RSTCFG</name>
                    <description>RESET Config Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EMCRST_EN-->
                        <field>
                            <name>EMCRST_EN</name>
                            <description>EMC reset enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EMC reset is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EMC reset is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LKUPRST_EN-->
                        <field>
                            <name>LKUPRST_EN</name>
                            <description>LOCKUP reset enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LOCKUP reset is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LOCKUP reset is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
