zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--SOFTRST: SOFT reset Register-->
                <register>
                    <name>SOFTRST</name>
                    <description>soft reset Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SOFTRESET</name>
                            <description>Write softreset key word to reset CPU</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RSTFLAG:RESET FLAG Register -->
                <register>
                    <name>RSTFLAG</name>
                    <description>RESET FLAG Register </description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--NVICN_FLAG-->
                        <field>
                            <name>NVICN_FLAG</name>
                            <description>NVIC reset flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_NVIC</name>
                                    <description>no NVIC reset </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NVIC</name>
                                    <description>NVIC reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LKUPN_FLAG-->
                        <field>
                            <name>LKUPN_FLAG</name>
                            <description>LOCKUP reset flag</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_LUCKUP</name>
                                    <description>no LUCKUP reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LUCKUP</name>
                                    <description>LUCKUP reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WWDTN_FLAG-->
                        <field>
                            <name>WWDTN_FLAG</name>
                            <description>WWDT reset flag</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_WWDT</name>
                                    <description>no WWDT reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WWDT</name>
                                    <description>WWDT reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--IWDTN_FLAG-->
                        <field>
                            <name>IWDTN_FLAG</name>
                            <description>IWDT reset flag</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_IWDT</name>
                                    <description>no IWDT reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IWDT</name>
                                    <description>IWDT reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SOFTN_FLAG-->
                        <field>
                            <name>SOFTN_FLAG</name>
                            <description>SOFT reset flag</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_SOFT</name>
                                    <description>no SOFT reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SOFT</name>
                                    <description>SOFT reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EMCN_FLAG-->
                        <field>
                            <name>EMCN_FLAG</name>
                            <description>EMC reset flag</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_EMC</name>
                                    <description>no EMC reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EMC</name>
                                    <description>EMC reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PDRN_FLAG-->
                        <field>
                            <name>PDRN_FLAG</name>
                            <description>POWER DOWN reset flag</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_PDR</name>
                                    <description>no PDR reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDR</name>
                                    <description>PDR reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PORN_FLAG-->
                        <field>
                            <name>PORN_FLAG</name>
                            <description>POWER ON reset flag</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_POR</name>
                                    <description>no POR reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POR</name>
                                    <description>POR reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TESTN_FLAG-->
                        <field>
                            <name>TESTN_FLAG</name>
                            <description>TEST reset flag</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_TEST</name>
                                    <description>no TEST reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TEST</name>
                                    <description>TEST reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--NRSTN_FLAG-->
                        <field>
                            <name>NRSTN_FLAG</name>
                            <description>NRST reset flag</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_NRST</name>
                                    <description>no NRST reset</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NRST</name>
                                    <description>NRST reset occurs</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
