zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--SYSCLKSEL: system clock select Register -->
                <register>
                    <name>SYSCLKSEL</name>
                    <description>system clock select Register </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02008300</resetValue>
                    <fields>
                        <!--SYSCLKSEL-->
                        <field>
                            <name>SYSCLKSEL</name>
                            <description>System clock select bit</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RCHF</name>
                                    <description>system clock source is RCHF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLF</name>
                                    <description>system clock source is RCLF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>system clock source is LSCLK</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLL</name>
                                    <description>system clock source is PLL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--AHBPRES-->
                        <field>
                            <name>AHBPRES</name>
                            <description>AHB clk divide</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>AHB clock is not divided at 0x0xx</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>AHB clock is divided by 2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>AHB clock is divided by 4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>AHB clock is divided by 8</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>AHB clock is divided by 16</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--APBPRES-->
                        <field>
                            <name>APBPRES</name>
                            <description>APB clk divide</description>
                            <bitRange>[18:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <description>APB clock is not divided at 0x0xx</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV2</name>
                                    <description>APB clock is divided by 2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV4</name>
                                    <description>APB clock is divided by 4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV8</name>
                                    <description>AHB clock is divided by 8</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV16</name>
                                    <description>AHB clock is divided by 16</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTICKSEL-->
                        <field>
                            <name>EXTICKSEL</name>
                            <description>EXTI clk select</description>
                            <bitRange>[24:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>AHBCLK</name>
                                    <description>EXTI sample clk selects AHBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>EXTI sample clk selects LSCLK</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SLP_ENEXTI-->
                        <field>
                            <name>SLP_ENEXTI</name>
                            <description>EXTI sample clk enable bit ,at sleep/deepsleep mode</description>
                            <bitRange>[25:25]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EXTI sample clk disable </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EXTI sample clk enable </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WKUPCLK-->
                        <field>
                            <name>WKUPCLK</name>
                            <description>wakeup clk select</description>
                            <bitRange>[26:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8MHz</name>
                                    <description>running at 8MHz after wakeup</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>512KHz</name>
                                    <description>running at 512KHz after wakeup</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LSBKSEL-->
                        <field>
                            <name>LSBKSEL</name>
                            <description>LSCLK CLK SOURCE SELECT (only at crystless mode)</description>
                            <bitRange>[30:30]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>RCLP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLF</name>
                                    <description>RCLF</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPM_RCLP_OFF-->
                        <field>
                            <name>LPM_RCLP_OFF</name>
                            <description>RCLP enable bit at Sleep/Stop mode (only at crystless mode)</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>Keep RCLP on at sleep/stop mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>close RCLP at sleep/stop mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RCHFCON: RCHF config Register -->
                <register>
                    <name>RCHFCON</name>
                    <description>RCHF config Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RCHFEN-->
                        <field>
                            <name>RCHFEN</name>
                            <description>RCHF enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RCHF is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RCHF is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FSEL-->
                        <field>
                            <name>FSEL</name>
                            <description>RCHF frequency select</description>
                            <bitRange>[19:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8MHz</name>
                                    <description>RCHF center frequency is 8MHz</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16MHz</name>
                                    <description>RCHF center frequency is 16MHz</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>24MHz</name>
                                    <description>RCHF center frequency is 24MHz</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>36MHz</name>
                                    <description>RCHF center frequency is 36MHz</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
