zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--RSTCFG: RESET Config Register-->
                <register>
                    <name>RCHFTRIM</name>
                    <description>RCHF trim Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <!--RCHFTRIM-->
                        <field>
                            <name>RCHFTRIM</name>
                            <description>RCHF trim bit</description>
                            <bitRange>[6:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--PLLCON: PLL Config Register-->
                <register>
                    <name>PLLCON</name>
                    <description>PLL Config Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x01F30000</resetValue>
                    <fields>
                        <!--PLLEN-->
                        <field>
                            <name>PLLEN</name>
                            <description>PLL enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>PLL is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>PLL is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PLLINSEL-->
                        <field>
                            <name>PLLINSEL</name>
                            <description>PLL input clk source select</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>XTLF</name>
                                    <description>PLL input clk source is XTLF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>PLL input clk source is RCLP</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF/256</name>
                                    <description>PLL input clk source is RCHF/256</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTLF</name>
                                    <description>PLL input clk source is XTLF</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PLLOSEL-->
                        <field>
                            <name>PLLOSEL</name>
                            <description>PLL output select</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>VCO/2</name>
                                    <description>PLL output is VCO/2</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>VCO</name>
                                    <description>PLL output is VCO</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PLLDB-->
                        <field>
                            <name>PLLDB</name>
                            <description>PLLDB</description>
                            <bitRange>[25:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RCLPCON: RCLP Config Register-->
                <register>
                    <name>RCLPCON</name>
                    <description>RCLP config Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RCLP_EN_B-->
                        <field>
                            <name>RCLP_EN_B</name>
                            <description>RCLP enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RCLP is enable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RCLP is disable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RCLPTRIM: RCLP TRIM Register-->
                <register>
                    <name>RCLPTRIM</name>
                    <description>RCLP TRIM Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000008</resetValue>
                    <fields>
                        <!--RCLPTRIM-->
                        <field>
                            <name>RCLPTRIM</name>
                            <description>RCLP TRIM bit</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--XTLFIPW: XTLF IPW Config Register-->
                <register>
                    <name>XTLFIPW</name>
                    <description>XTLF IPW Config Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--XTLFIPW-->
                        <field>
                            <name>XTLFIPW</name>
                            <description>XTLF IPW bit</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>450 nA</name>
                                    <description>XTLF IPW is 450 nA</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>400 nA</name>
                                    <description>XTLF IPW is 400 nA</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>350 nA</name>
                                    <description>XTLF IPW is 350 nA</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>300 nA</name>
                                    <description>XTLF IPW is 300 nA</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>250 nA</name>
                                    <description>XTLF IPW is 250 nA</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>200 nA</name>
                                    <description>XTLF IPW is 200 nA</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>150 nA</name>
                                    <description>XTLF IPW is 150 nA</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100 nA</name>
                                    <description>XTLF IPW is 100 nA</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--PERCLKCON1: peripheral clk Config Register 1-->
                <register>
                    <name>PERCLKCON1</name>
                    <description>peripheral clk Config Register 1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000058</resetValue>
                    <fields>
                        <!--LPTRCKEN-->
                        <field>
                            <name>LPTRCKEN</name>
                            <description>LPTIM reg clk enable </description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LPTIM reg clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LPTIM reg clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LPTFCKEN-->
                        <field>
                            <name>LPTFCKEN</name>
                            <description>LPTIM function clk enable </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>LPTIM function clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>LPTIM function clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RTCCKEN-->
                        <field>
                            <name>RTCCKEN</name>
                            <description>RTC clk enable </description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>RTC clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>RTC clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PMUCKEN-->
                        <field>
                            <name>PMUCKEN</name>
                            <description>PMU clk enable </description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>PMU clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>PMU clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SCUCKEN-->
                        <field>
                            <name>SCUCKEN</name>
                            <description>SCU clk enable </description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>SCU clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>SCU clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--IWDTCKEN-->
                        <field>
                            <name>IWDTCKEN</name>
                            <description>IWDT clk enable </description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>IWDT clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>IWDT clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ANACCKEN-->
                        <field>
                            <name>ANACCKEN</name>
                            <description>ANAC clk enable </description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ANAC clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ANAC clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PDCCKEN-->
                        <field>
                            <name>PDCCKEN</name>
                            <description>PDC clk enable </description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>PDC clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>PDC clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTICKEN0-->
                        <field>
                            <name>EXTICKEN0</name>
                            <description>EXTI0 sample clk enable </description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EXTI0 sample clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EXTI0 sample clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTICKEN1-->
                        <field>
                            <name>EXTICKEN1</name>
                            <description>EXTI1 sample clk enable </description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EXTI1 sample clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EXTI1 sample clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTICKEN2-->
                        <field>
                            <name>EXTICKEN2</name>
                            <description>EXTI2 sample clk enable </description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>EXTI2 sample clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>EXTI2 sample clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DCUCKEN-->
                        <field>
                            <name>DCUCKEN</name>
                            <description>DCU clk enable </description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DCU clk is disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>DCU clk is enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
