zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--CH2RAMAD:  DMA channel2 RAM address Register-->
                <register>
                    <name>CH2RAMAD</name>
                    <description>DMA channel2 RAM address Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH2RAMAD-->
                        <field>
                            <name>CH2RAMAD</name>
                            <description>CH2 RAM address</description>
                            <bitRange>[14:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH3CTRL: DMA channel3 control Register-->
                <register>
                    <name>CH3CTRL</name>
                    <description>DMA CH3 control Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH3EN-->
                        <field>
                            <name>CH3EN</name>
                            <description>channel3 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH3 disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH3 enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH3HTIE-->
                        <field>
                            <name>CH3HTIE</name>
                            <description>channel3 half transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH3 half transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH3 half transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH3FTIE-->
                        <field>
                            <name>CH3FTIE</name>
                            <description>channel3 full transmit interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH3 full transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH3 full transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH3SSEL-->
                        <field>
                            <name>CH3SSEL</name>
                            <description>channel3 periph source select</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BT34_CAP</name>
                                    <description>Basetimer34 capture data</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ET1_CAP</name>
                                    <description>Etimer1 capture data</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C_TX</name>
                                    <description>I2C transmit data</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>U78161_RX</name>
                                    <description>U78161 receive data</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART4_RX</name>
                                    <description>UART4 receive data</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_RX</name>
                                    <description>UART1 receive data</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0_RX</name>
                                    <description>UART0 receive data</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI1_RX</name>
                                    <description>SPI1 receive data</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH3INC-->
                        <field>
                            <name>CH3INC</name>
                            <description>channel3 RAM address increase setting</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel3 RAM address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel3 RAM address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH3PRI-->
                        <field>
                            <name>CH3PRI</name>
                            <description>channel3 priority setting</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>channel3's priority is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Medium</name>
                                    <description>channel3's priority is Medium</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>channel3's priority is High</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Very High</name>
                                    <description>channel3's priority is Very High</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH3TSIZE-->
                        <field>
                            <name>CH3TSIZE</name>
                            <description>channel3 transmit size setting</description>
                            <bitRange>[28:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH3RAMAD:  DMA channel3 RAM address Register-->
                <register>
                    <name>CH3RAMAD</name>
                    <description>DMA channel3 RAM address Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH3RAMAD-->
                        <field>
                            <name>CH3RAMAD</name>
                            <description>CH3 RAM address</description>
                            <bitRange>[14:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH4CTRL: DMA channel4 control Register-->
                <register>
                    <name>CH4CTRL</name>
                    <description>DMA CH4 control Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH4EN-->
                        <field>
                            <name>CH4EN</name>
                            <description>channel4 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH4 disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH4 enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH4HTIE-->
                        <field>
                            <name>CH4HTIE</name>
                            <description>channel4 half transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH4 half transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH4 half transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH4FTIE-->
                        <field>
                            <name>CH4FTIE</name>
                            <description>channel4 full transmit interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH4 full transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH4 full transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH4SSEL-->
                        <field>
                            <name>CH4SSEL</name>
                            <description>channel4 periph source select</description>
                            <bitRange>[10:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ET2_CAP</name>
                                    <description>Etimer2 capture data</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AES_IN</name>
                                    <description>AES input data</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C_RX</name>
                                    <description>I2C receive data</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>U78161_TX</name>
                                    <description>U78161 transmit data</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART4_TX</name>
                                    <description>UART4 transmit data</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_TX</name>
                                    <description>UART1 transmit data</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART0_TX</name>
                                    <description>UART0 transmit data</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SPI1_TX</name>
                                    <description>SPI1 transmit data</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH4INC-->
                        <field>
                            <name>CH4INC</name>
                            <description>channel4 RAM address increase setting</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel4 RAM address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel4 RAM address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH4PRI-->
                        <field>
                            <name>CH4PRI</name>
                            <description>channel4 priority setting</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>channel4's priority is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Medium</name>
                                    <description>channel4's priority is Medium</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>channel4's priority is High</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Very High</name>
                                    <description>channel4's priority is Very High</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH4TSIZE-->
                        <field>
                            <name>CH4TSIZE</name>
                            <description>channel4 transmit size setting</description>
                            <bitRange>[28:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
