zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--CH6RAMAD:  DMA channel6 RAM address Register-->
                <register>
                    <name>CH6RAMAD</name>
                    <description>DMA channel6 RAM address Register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH6RAMAD-->
                        <field>
                            <name>CH6RAMAD</name>
                            <description>CH6 RAM address</description>
                            <bitRange>[14:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH7CTRL: DMA channel7 control Register-->
                <register>
                    <name>CH7CTRL</name>
                    <description>DMA CH7 control Register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH7EN-->
                        <field>
                            <name>CH7EN</name>
                            <description>channel7 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH7 disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH7 enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH7HTIE-->
                        <field>
                            <name>CH7HTIE</name>
                            <description>channel7 half transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH7 half transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH7 half transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH7FTIE-->
                        <field>
                            <name>CH7FTIE</name>
                            <description>channel7 full transmit interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>CH7 full transmit interrupt disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>CH7 full transmit interrupt enable</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH7FI-->
                        <field>
                            <name>CH7FI</name>
                            <description>channel7 flash address increase setting</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel7 flash address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel7 flash address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH7RI-->
                        <field>
                            <name>CH7RI</name>
                            <description>channel7 RAM address increase setting</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DECREASE</name>
                                    <description>channel7 RAM address decrease</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INCREASE</name>
                                    <description>channel7 RAM address increase</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH7DIR-->
                        <field>
                            <name>CH7DIR</name>
                            <description>channel7 transmit direction setting</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RAM2FLASH</name>
                                    <description>from RAM to flash</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FLASH2RAM</name>
                                    <description>FROM flash to RAM</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH7PRI-->
                        <field>
                            <name>CH7PRI</name>
                            <description>channel7 priority setting</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>channel7's priority is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Medium</name>
                                    <description>channel7's priority is Medium</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>High</name>
                                    <description>channel7's priority is High</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Very High</name>
                                    <description>channel7's priority is Very High</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CH7TSIZE-->
                        <field>
                            <name>CH7TSIZE</name>
                            <description>channel7 transmit size setting(fixed size 64 when transmits from ram to flash )</description>
                            <bitRange>[28:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH7FLSAD:  DMA channel7 flash address Register-->
                <register>
                    <name>CH7FLSAD</name>
                    <description>DMA channel7 flash address Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH7FLSAD-->
                        <field>
                            <name>CH7FLSAD</name>
                            <description>CH7 flash address</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CH7RAMAD:  DMA channel7 RAM address Register-->
                <register>
                    <name>CH7RAMAD</name>
                    <description>DMA channel7 RAM address Register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CH7RAMAD-->
                        <field>
                            <name>CH7RAMAD</name>
                            <description>CH7 RAM address</description>
                            <bitRange>[12:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
