zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--CHSTATUS: DMA status Register-->
                <register>
                    <name>CHSTATUS</name>
                    <description>DMA status Register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DMACHHT0-->
                        <field>
                            <name>DMACHHT0</name>
                            <description>channel0 half transmit status bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel0 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel0 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHHT1-->
                        <field>
                            <name>DMACHHT1</name>
                            <description>channel1 half transmit status bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel1 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel1 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHHT2-->
                        <field>
                            <name>DMACHHT2</name>
                            <description>channel2 half transmit status bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel1 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel1 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHHT3-->
                        <field>
                            <name>DMACHHT3</name>
                            <description>channel3 half transmit status bit</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel3 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel3 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHHT4-->
                        <field>
                            <name>DMACHHT4</name>
                            <description>channel4 half transmit status bit</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel4 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel4 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHHT5-->
                        <field>
                            <name>DMACHHT5</name>
                            <description>channel5 half transmit status bit</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel5 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel5 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHHT6-->
                        <field>
                            <name>DMACHHT6</name>
                            <description>channel6 half transmit status bit</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel6 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel6 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHHT7-->
                        <field>
                            <name>DMACHHT7</name>
                            <description>channel7 half transmit status bit</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel7 half transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel7 half transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT0-->
                        <field>
                            <name>DMACHFT0</name>
                            <description>channel0 transmit status bit</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel0 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel0 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT1-->
                        <field>
                            <name>DMACHFT1</name>
                            <description>channel1 transmit status bit</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel1 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel1 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT2-->
                        <field>
                            <name>DMACHFT2</name>
                            <description>channel2 transmit status bit</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel2 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel2 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT3-->
                        <field>
                            <name>DMACHFT3</name>
                            <description>channel3 transmit status bit</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel3 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel3 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT4-->
                        <field>
                            <name>DMACHFT4</name>
                            <description>channel4 transmit status bit</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel4 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel4 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT5-->
                        <field>
                            <name>DMACHFT5</name>
                            <description>channel5 transmit status bit</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel5 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel5 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT6-->
                        <field>
                            <name>DMACHFT6</name>
                            <description>channel6 transmit status bit</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel6 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel6 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DMACHFT7-->
                        <field>
                            <name>DMACHFT7</name>
                            <description>channel7 transmit status bit</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOT_FINISH</name>
                                    <description>channel7 transmit - not start/not finish</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FINISH</name>
                                    <description>channel7 transmit - finish</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
