zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--HSPI-->
        <peripheral>
            <name>HSPI</name>
            <description>High speed SPI</description>
            <groupName>HSPI</groupName>
            <baseAddress>0x40000800</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HSPI</name>
                <value>6</value>
            </interrupt>
            <registers>
                <!--HSPICR1: Control Register1-->
                <register>
                    <name>HSPICR1</name>
                    <description>HSPI Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CPHA-->
                        <field>
                            <name>CPHA</name>
                            <description>Clock phase bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIRST</name>
                                    <description>capture at First edge </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SECOND</name>
                                    <description>capture at Second edge </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CPHOL-->
                        <field>
                            <name>CPHOL</name>
                            <description>Clock polarity bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <description>Idle clock voltage is low</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <description>Idle clock voltage is low</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--LSBF-->
                        <field>
                            <name>LSBF</name>
                            <description>Frame format bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MSB</name>
                                    <description>MSB first</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSB</name>
                                    <description>LSB first</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BAUD_RATE-->
                        <field>
                            <name>BAUD_RATE</name>
                            <description>BAUD_RATE setting</description>
                            <bitRange>[5:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>fPCLK </name>
                                    <description>only Master mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/2</name>
                                    <description>only Master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/4</name>
                                    <description>only Master mode</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/8</name>
                                    <description>only Master mode</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/16</name>
                                    <description>only Master mode</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/32</name>
                                    <description>only Master mode</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/64</name>
                                    <description>only Master mode</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>fPCLK/128</name>
                                    <description>only Master mode</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--WAIT-->
                        <field>
                            <name>WAIT</name>
                            <description>WAIT clock setting at master mode,(1+wait) clock</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MM-->
                        <field>
                            <name>MM</name>
                            <description>Master/Slave mode select</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SLAVE </name>
                                    <description>slave mode</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Master</name>
                                    <description>Master mode</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DELAY_CFG-->
                        <field>
                            <name>DELAY_CFG</name>
                            <description>DELAY time setting for master sample delay /slave sending ahead</description>
                            <bitRange>[11:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DELAY/NO_AHEAD</name>
                                    <description>NO_DELAY at master/NO_AHEAD at slave</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10NS/0.5SCK-20NS</name>
                                    <description>10NS delay at master/0.5SCK-20NS ahead at slave</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>20NS/0.5SCK-15NS</name>
                                    <description>20NS delay at master/0.5SCK-15NS ahead at slave</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>30NS/0.5SCK-10NS</name>
                                    <description>30NS delay at master/0.5SCK-10NS ahead at slave</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>40NS/0.5SCK-5NS</name>
                                    <description>40NS delay at master/0.5SCK-5NS ahead at slave</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0.5SCK</name>
                                    <description>0.5SCK delay at master/0.5SCK ahead at slave</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0.5SCK</name>
                                    <description>0.5SCK delay at master/0.5SCK ahead at slave</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0.5SCK</name>
                                    <description>0.5SCK delay at master/0.5SCK ahead at slave</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
