zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--SPICR3: Control Register3-->
                <register>
                    <name>SPICR3</name>
                    <description>control Register3</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SERRC-->
                        <field>
                            <name>SERRC</name>
                            <description>Slave Error Clear bit,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MERRC-->
                        <field>
                            <name>MERRC</name>
                            <description>Master Error Clear bit,write 1 to clear</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXBFC-->
                        <field>
                            <name>RXBFC</name>
                            <description>Receive Buffer Clear bit,write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXBFC-->
                        <field>
                            <name>TXBFC</name>
                            <description>Transmit Buffer Clear bit,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SPIIE: SPI interrupt enable Register-->
                <register>
                    <name>SPIIE</name>
                    <description>SPI interrupt enable Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXIE-->
                        <field>
                            <name>RXIE</name>
                            <description>receive interrupt enable bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE-->
                        <field>
                            <name>TXIE</name>
                            <description>transmit interrupt enable bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ERRIE-->
                        <field>
                            <name>ERRIE</name>
                            <description>error interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SPIIF: SPI interrupt flag Register-->
                <register>
                    <name>SPIIF</name>
                    <description>SPI interrupt flag Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--RXBF-->
                        <field>
                            <name>RXBF</name>
                            <description>RX Buffer Full,read RXBUF clear this bit</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--TXBE-->
                        <field>
                            <name>TXBE</name>
                            <description>TX Buffer Empty,write TXBUF clear this bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>HSPI transmit flag</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--TXCOL-->
                        <field>
                            <name>TXCOL</name>
                            <description>TX Buffer overflow,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXCOL-->
                        <field>
                            <name>RXCOL</name>
                            <description>RX Buffer overflow,write 1 to clear</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SERR-->
                        <field>
                            <name>SERR</name>
                            <description>Slave Error</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--MERR-->
                        <field>
                            <name>MERR</name>
                            <description>Master Error</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
