zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--SPITXBUF: SPI TX buffer Register-->
                <register>
                    <name>SPITXBUF</name>
                    <description>SPI TX buffer Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXBUF-->
                        <field>
                            <name>TXBUF</name>
                            <description>TXBUF 8BIT</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SPIRXBUF: SPI RX buffer Register-->
                <register>
                    <name>SPIRXBUF</name>
                    <description>SPI RX buffer Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXBUF-->
                        <field>
                            <name>RXBUF</name>
                            <description>RXBUF 8bit</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--SPI2-->
        <peripheral derivedFrom="SPI1">
            <name>SPI2</name>
            <baseAddress>0x40000880</baseAddress>
            <interrupt>
                <name>SPI2</name>
                <value>8</value>
            </interrupt>
        </peripheral>
        <!--GPIOA-->
        <peripheral>
            <name>GPIOA</name>
            <description>GPIO PORTA</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x40000C00</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--INEN : input enable Register-->
                <register>
                    <name>INEN</name>
                    <description>input enable Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PxINEN-->
                        <field>
                            <name>PxINEN</name>
                            <description>input enable, pin 0-15</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--PUEN: pullup enable Register-->
                <register>
                    <name>PUEN</name>
                    <description>pullup enable Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PxPUEN-->
                        <field>
                            <name>PxPUEN</name>
                            <description>IO pull-up control</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ODEN: open-drain Control Register-->
                <register>
                    <name>ODEN</name>
                    <description>open-drain Control Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PxODEN-->
                        <field>
                            <name>PxODEN</name>
                            <description>open-drain control,pin0-15</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--FCR: function control Register-->
                <register>
                    <name>FCR</name>
                    <description>function control Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--Px0FCR-->
                        <field>
                            <name>Px0FCR</name>
                            <description>Px0 function select</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px1FCR-->
                        <field>
                            <name>Px1FCR</name>
                            <description>Px1 function select</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px2FCR-->
                        <field>
                            <name>Px2FCR</name>
                            <description>Px2 function select</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px3FCR-->
                        <field>
                            <name>Px3FCR</name>
                            <description>Px3 function select</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px4FCR-->
                        <field>
                            <name>Px4FCR</name>
                            <description>Px4 function select</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px5FCR-->
                        <field>
                            <name>Px5FCR</name>
                            <description>Px5 function select</description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px6FCR-->
                        <field>
                            <name>Px6FCR</name>
                            <description>Px6 function select</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px7FCR-->
                        <field>
                            <name>Px7FCR</name>
                            <description>Px7 function select</description>
                            <bitRange>[15:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px8FCR-->
                        <field>
                            <name>Px8FCR</name>
                            <description>Px8 function select</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px9FCR-->
                        <field>
                            <name>Px9FCR</name>
                            <description>Px9 function select</description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px10FCR-->
                        <field>
                            <name>Px10FCR</name>
                            <description>Px10 function select</description>
                            <bitRange>[21:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
                                    <description>Analog function</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--Px11FCR-->
                        <field>
                            <name>Px11FCR</name>
                            <description>Px11 function select</description>
                            <bitRange>[23:22]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INPUT</name>
                                    <description>GPIO INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUTPUT</name>
                                    <description>GPIO OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Digital</name>
                                    <description>Digital function</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Analog</name>
