zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--GPIOB-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOB</name>
            <baseAddress>0x40000C20</baseAddress>
        </peripheral>
        <!--GPIOC-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOC</name>
            <baseAddress>0x40000C40</baseAddress>
        </peripheral>
        <!--GPIOD-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOD</name>
            <baseAddress>0x40000C60</baseAddress>
        </peripheral>
        <!--GPIOE-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOE</name>
            <baseAddress>0x40000C80</baseAddress>
        </peripheral>
        <!--GPIOF-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOF</name>
            <baseAddress>0x40000CA0</baseAddress>
        </peripheral>
        <!--GPIOG-->
        <peripheral derivedFrom="GPIOA">
            <name>GPIOG</name>
            <baseAddress>0x40000CC0</baseAddress>
        </peripheral>
        <!--GPIO_COMMON-->
        <peripheral>
            <name>GPIO_COMMON</name>
            <description>GPIO_COMMON Registers</description>
            <groupName>GPIO_COMMON</groupName>
            <baseAddress>0x40000CE0</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>GPIO</name>
                <value>30</value>
            </interrupt>
            <registers>
                <!--EXTI0_SEL: GPIO EXTI Select 0-->
                <register>
                    <name>EXTI0_SEL</name>
                    <description>GPIO EXTI Select 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF0000</resetValue>
                    <fields>
                        <!--EXTI0_SEL0-->
                        <field>
                            <name>EXTI0_SEL0</name>
                            <description>EXTI0[0] input pin select</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA0</name>
                                    <description>EXTI0[0] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA8</name>
                                    <description>EXTI0[0]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB0</name>
                                    <description>EXTI0[0]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB8</name>
                                    <description>EXTI0[0] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_SEL1-->
                        <field>
                            <name>EXTI0_SEL1</name>
                            <description>EXTI0[1] input pin select</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA1</name>
                                    <description>EXTI0[1]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA9</name>
                                    <description>EXTI0[1] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB1</name>
                                    <description>EXTI0[1]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB9</name>
                                    <description>EXTI0[1]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_SEL2-->
                        <field>
                            <name>EXTI0_SEL2</name>
                            <description>EXTI0[2] input pin select</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA2</name>
                                    <description>EXTI0[2]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA10</name>
                                    <description>EXTI0[2] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB2</name>
                                    <description>EXTI0[2]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB10</name>
                                    <description>EXTI0[2]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_SEL3-->
                        <field>
                            <name>EXTI0_SEL3</name>
                            <description>EXTI0[3] input pin select</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA3</name>
                                    <description>EXTI0[3]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA11</name>
                                    <description>EXTI0[3] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB3</name>
                                    <description>EXTI0[3]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB10</name>
                                    <description>EXTI0[3]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_SEL4-->
                        <field>
                            <name>EXTI0_SEL4</name>
                            <description>EXTI0[4] input pin select</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA4</name>
                                    <description>EXTI0[4]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA12</name>
                                    <description>EXTI0[4] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB4</name>
                                    <description>EXTI0[4]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB12</name>
                                    <description>EXTI0[4]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_SEL5-->
                        <field>
                            <name>EXTI0_SEL5</name>
                            <description>EXTI0[5] input pin select</description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA5</name>
                                    <description>EXTI0[5]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA13</name>
                                    <description>EXTI0[5] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB5</name>
                                    <description>EXTI0[5]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB13</name>
                                    <description>EXTI0[5]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_SEL6-->
                        <field>
                            <name>EXTI0_SEL6</name>
                            <description>EXTI0[6] input pin select</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA6</name>
                                    <description>EXTI0[6]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA14</name>
                                    <description>EXTI0[6] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB6</name>
                                    <description>EXTI0[6]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB14</name>
                                    <description>EXTI0[6]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_SEL7-->
                        <field>
                            <name>EXTI0_SEL7</name>
                            <description>EXTI0[7] input pin select</description>
                            <bitRange>[15:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PA7</name>
                                    <description>EXTI0[7]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PA15</name>
                                    <description>EXTI0[7] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB7</name>
                                    <description>EXTI0[7]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PB15</name>
                                    <description>EXTI0[7]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS0-->
                        <field>
                            <name>EXTI0_EDS0</name>
                            <description>EXTI0[0] trigger edge select</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[0] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[0]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[0]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[0] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS1-->
                        <field>
                            <name>EXTI0_EDS1</name>
                            <description>EXTI0[1] trigger edge select</description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[1] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[1]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[1]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[1] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS2-->
                        <field>
                            <name>EXTI0_EDS2</name>
                            <description>EXTI0[2] trigger edge select</description>
                            <bitRange>[21:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[2] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[2]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[2]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[2] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS3-->
                        <field>
                            <name>EXTI0_EDS3</name>
                            <description>EXTI0[3] trigger edge select</description>
                            <bitRange>[23:22]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[3] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[3]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[3]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[3] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS4-->
                        <field>
                            <name>EXTI0_EDS4</name>
                            <description>EXTI0[4] trigger edge select</description>
                            <bitRange>[25:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[4] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[4]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[4]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[4] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS5-->
                        <field>
                            <name>EXTI0_EDS5</name>
                            <description>EXTI0[5] trigger edge select</description>
                            <bitRange>[27:26]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[5] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[5]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[5]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[5] </description>
                                    <value>3</value>
                                </enumeratedValue>
