zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS6-->
                        <field>
                            <name>EXTI0_EDS6</name>
                            <description>EXTI0[6] trigger edge select</description>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[6] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[6]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[6]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[6] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI0_EDS7-->
                        <field>
                            <name>EXTI0_EDS7</name>
                            <description>EXTI0[7] trigger edge select</description>
                            <bitRange>[31:30]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI0[7] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI0[7]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI0[7]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI0[7] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--EXTI1_SEL: GPIO EXTI Select 1-->
                <register>
                    <name>EXTI1_SEL</name>
                    <description>GPIO EXTI Select 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF0000</resetValue>
                    <fields>
                        <!--EXTI1_SEL0-->
                        <field>
                            <name>EXTI1_SEL0</name>
                            <description>EXTI1[0] input pin select</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC0</name>
                                    <description>EXTI1[0] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC8</name>
                                    <description>EXTI1[0]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD0</name>
                                    <description>EXTI1[0]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD8</name>
                                    <description>EXTI1[0] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_SEL1-->
                        <field>
                            <name>EXTI1_SEL1</name>
                            <description>EXTI1[1] input pin select</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC1</name>
                                    <description>EXTI1[1]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC9</name>
                                    <description>EXTI1[1] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD1</name>
                                    <description>EXTI1[1]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD9</name>
                                    <description>EXTI1[1]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_SEL2-->
                        <field>
                            <name>EXTI1_SEL2</name>
                            <description>EXTI1[2] input pin select</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC2</name>
                                    <description>EXTI1[2]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC10</name>
                                    <description>EXTI1[2] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD2</name>
                                    <description>EXTI1[2]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD10</name>
                                    <description>EXTI1[2]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_SEL3-->
                        <field>
                            <name>EXTI1_SEL3</name>
                            <description>EXTI1[3] input pin select</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC3</name>
                                    <description>EXTI1[3]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC11</name>
                                    <description>EXTI1[3] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD3</name>
                                    <description>EXTI1[3]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD11</name>
                                    <description>EXTI1[3]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_SEL4-->
                        <field>
                            <name>EXTI1_SEL4</name>
                            <description>EXTI1[4] input pin select</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC4</name>
                                    <description>EXTI1[4]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC12</name>
                                    <description>EXTI1[4] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD4</name>
                                    <description>EXTI1[4]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD12</name>
                                    <description>EXTI1[4]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_SEL5-->
                        <field>
                            <name>EXTI1_SEL5</name>
                            <description>EXTI1[5] input pin select</description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC5</name>
                                    <description>EXTI1[5]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC13</name>
                                    <description>EXTI1[5] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD5</name>
                                    <description>EXTI1[5]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD13</name>
                                    <description>EXTI1[5]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_SEL6-->
                        <field>
                            <name>EXTI1_SEL6</name>
                            <description>EXTI1[6] input pin select</description>
                            <bitRange>[13:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC6</name>
                                    <description>EXTI1[6]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC14</name>
                                    <description>EXTI1[6] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD6</name>
                                    <description>EXTI1[6]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD14</name>
                                    <description>EXTI1[6]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_SEL7-->
                        <field>
                            <name>EXTI1_SEL7</name>
                            <description>EXTI1[7] input pin select</description>
                            <bitRange>[15:14]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC7</name>
                                    <description>EXTI1[7]</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PC15</name>
                                    <description>EXTI1[7] </description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD7</name>
                                    <description>EXTI1[7]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PD15</name>
                                    <description>EXTI1[7]</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS0-->
                        <field>
                            <name>EXTI1_EDS0</name>
                            <description>EXTI1[0] trigger edge select</description>
                            <bitRange>[17:16]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[0] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[0]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[0]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[0] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS1-->
                        <field>
                            <name>EXTI1_EDS1</name>
                            <description>EXTI1[1] trigger edge select</description>
                            <bitRange>[19:18]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[1] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[1]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[1]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[1] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS2-->
                        <field>
                            <name>EXTI1_EDS2</name>
                            <description>EXTI1[2] trigger edge select</description>
                            <bitRange>[21:20]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[2] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[2]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[2]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[2] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS3-->
                        <field>
                            <name>EXTI1_EDS3</name>
                            <description>EXTI1[3] trigger edge select</description>
                            <bitRange>[23:22]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[3] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[3]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[3]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[3] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI1_EDS4-->
                        <field>
                            <name>EXTI1_EDS4</name>
                            <description>EXTI1[4] trigger edge select</description>
                            <bitRange>[25:24]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI1[4] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI1[4]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI1[4]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI1[4] </description>
