zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[5] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[5]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[5]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[5] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS6-->
                        <field>
                            <name>EXTI1_EDS6</name>
                            <description>EXTI1[6] trigger edge select</description>
                            <bitRange>[29:28]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[6] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[6]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[6]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[6] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXTI2_EDS7-->
                        <field>
                            <name>EXTI2_EDS7</name>
                            <description>EXTI2[7] trigger edge select</description>
                            <bitRange>[31:30]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Rising</name>
                                    <description>EXTI2[7] </description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Falling</name>
                                    <description>EXTI2[7]</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Both</name>
                                    <description>EXTI2[7]</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Disable</name>
                                    <description>EXTI2[7] </description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--EXTI0IF: GPIO EXTI interrupt flag 0-->
                <register>
                    <name>EXTI0IF</name>
                    <description>GPIO EXTI interrupt flag 0</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EXTI0IF[0]-->
                        <field>
                            <name>EXTI0IF0</name>
                            <description>EXTI0 interrupt flag 0,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI0IF[1]-->
                        <field>
                            <name>EXTI0IF1</name>
                            <description>EXTI0 interrupt flag 1,write 1 to clear</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI0IF[2]-->
                        <field>
                            <name>EXTI0IF2</name>
                            <description>EXTI0 interrupt flag 2,write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI0IF[3]-->
                        <field>
                            <name>EXTI0IF3</name>
                            <description>EXTI0 interrupt flag 3,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI0IF[4]-->
                        <field>
                            <name>EXTI0IF4</name>
                            <description>EXTI0 interrupt flag 4,write 1 to clear</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI0IF[5]-->
                        <field>
                            <name>EXTI0IF5</name>
                            <description>EXTI0 interrupt flag 5,write 1 to clear</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI0IF[6]-->
                        <field>
                            <name>EXTI0IF6</name>
                            <description>EXTI0 interrupt flag 6,write 1 to clear</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI0IF[7]-->
                        <field>
                            <name>EXTI0IF7</name>
                            <description>EXTI0 interrupt flag 7,write 1 to clear</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--EXTI1IF: GPIO EXTI interrupt flag 1-->
                <register>
                    <name>EXTI1IF</name>
                    <description>GPIO EXTI interrupt flag 1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EXTI1IF[0]-->
                        <field>
                            <name>EXTI1IF0</name>
                            <description>EXTI1 interrupt flag 0,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI1IF[1]-->
                        <field>
                            <name>EXTI1IF1</name>
                            <description>EXTI1 interrupt flag 1,write 1 to clear</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI1IF[2]-->
                        <field>
                            <name>EXTI1IF2</name>
                            <description>EXTI1 interrupt flag 2,write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI1IF[3]-->
                        <field>
                            <name>EXTI1IF3</name>
                            <description>EXTI1 interrupt flag 3,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI1IF[4]-->
                        <field>
                            <name>EXTI1IF4</name>
                            <description>EXTI1 interrupt flag 4,write 1 to clear</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI1IF[5]-->
                        <field>
                            <name>EXTI1IF5</name>
                            <description>EXTI1 interrupt flag 5,write 1 to clear</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI1IF[6]-->
                        <field>
                            <name>EXTI1IF6</name>
                            <description>EXTI1 interrupt flag 6,write 1 to clear</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI1IF[7]-->
                        <field>
                            <name>EXTI1IF7</name>
                            <description>EXTI1 interrupt flag 7,write 1 to clear</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--EXTI2IF: GPIO EXTI interrupt flag 2-->
                <register>
                    <name>EXTI2IF</name>
                    <description>GPIO EXTI interrupt flag 2</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--EXTI2IF[0]-->
                        <field>
                            <name>EXTI2IF0</name>
                            <description>EXTI2 interrupt flag 0,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI2IF[1]-->
                        <field>
                            <name>EXTI2IF1</name>
                            <description>EXTI2 interrupt flag 1,write 1 to clear</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI2IF[2]-->
                        <field>
                            <name>EXTI2IF2</name>
                            <description>EXTI2 interrupt flag 2,write 1 to clear</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI2IF[3]-->
                        <field>
                            <name>EXTI2IF3</name>
                            <description>EXTI2 interrupt flag 3,write 1 to clear</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI2IF[4]-->
                        <field>
                            <name>EXTI2IF4</name>
                            <description>EXTI2 interrupt flag 4,write 1 to clear</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI2IF[5]-->
                        <field>
                            <name>EXTI2IF5</name>
                            <description>EXTI2 interrupt flag 5,write 1 to clear</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI2IF[6]-->
                        <field>
                            <name>EXTI2IF6</name>
                            <description>EXTI2 interrupt flag 6,write 1 to clear</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXTI2IF[7]-->
                        <field>
                            <name>EXTI2IF7</name>
                            <description>EXTI2 interrupt flag 7,write 1 to clear</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--FOUTSEL: FOUT select -->
                <register>
                    <name>FOUTSEL</name>
                    <description>FOUT select </description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FOUTSEL-->
                        <field>
                            <name>FOUTSEL</name>
                            <description>FOUT select</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>XTLF</name>
                                    <description>FOUT select XTLF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>FOUT select RCLP</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCHF/64</name>
                                    <description>FOUT select  RCHF/64</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSCLK</name>
                                    <description>FOUT select LSCLK</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AHBCLK/64</name>
                                    <description>FOUT select AHBCLK/64</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCTM</name>
                                    <description>FOUT select RTCTM</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLO/64</name>
                                    <description>FOUT select PLLO/64</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RTCCLK64Hz</name>
                                    <description>FOUT select  RTCCLK64Hz</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>APBCLK/64</name>
                                    <description>FOUT select APBCLK/64</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LVMOS-Monitor-RCOSC/64</name>
                                    <description>FOUT select LVMOS-Monitor-RCOSC/64</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RFU</name>
                                    <description>RFU</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
