zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--NVMIF-->
        <peripheral>
            <name>NVMIF</name>
            <description>NVMIF Registers</description>
            <groupName>NVMIF</groupName>
            <baseAddress>0x40001000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>NVMIF</name>
                <value>3</value>
            </interrupt>
            <registers>
                <!--FLSRDCON: FLASH read control register-->
                <register>
                    <name>FLSRDCON</name>
                    <description>FLASH read control register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WAIT-->
                        <field>
                            <name>WAIT</name>
                            <description>wait cycle at flash resd </description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ZERO</name>
                                    <description>0 wait cycle</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONE</name>
                                    <description>1 wait cycle</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TWO</name>
                                    <description>2 wait cycle</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ZERO</name>
                                    <description>0 wait cycle</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--READM0-->
                        <field>
                            <name>READM0</name>
                            <description>PROG Margin Read</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE Margin Read</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE Margin Read</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE Margin Read</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE Margin Read</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--READM1-->
                        <field>
                            <name>READM1</name>
                            <description>ERASE Margin Read</description>
                            <bitRange>[11:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE Margin Read</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE Margin Read</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE Margin Read</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE Margin Read</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--PRFTCON: PREFATCH CONTROL REGISTER-->
                <register>
                    <name>PRFTCON</name>
                    <description>PREFATCH CONTROL REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DUMMY-->
                        <field>
                            <name>DUMMY</name>
                            <description>DUMMY</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--OPTBR: OPTBR-->
                <register>
                    <name>OPTBR</name>
                    <description>OPTBR</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000005</resetValue>
                    <fields>
                        <!--DBRDPEN-->
                        <field>
                            <name>DBRDPEN</name>
                            <description>debug port read protect</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>debug port read protect disable</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>debug port read protect disable</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>debug port read protect enable</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>debug port read protect disable</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ACLOCKEN-->
                        <field>
                            <name>ACLOCKEN</name>
                            <description>ACLOCKEN</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ACLOCK DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ACLOCK DISABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ACLOCK ENABLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>ACLOCK DISABLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--BTSEN-->
                        <field>
                            <name>BTSEN</name>
                            <description>BootSwap Enable</description>
                            <bitRange>[9:8]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DBGCFGEN-->
                        <field>
                            <name>DBGCFGEN</name>
                            <description>DEBUG CONFIG REGISTER ENABLE</description>
                            <bitRange>[31:31]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DEBUG CONFIG REGISTER DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>DEBUG CONFIG REGISTER ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
