zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--CRC-->
        <peripheral>
            <name>CRC</name>
            <description>CRC</description>
            <groupName>CRC</groupName>
            <baseAddress>0x40010000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--CRCDR: CRC DATA REGISTER-->
                <register>
                    <name>CRCDR</name>
                    <description>CRC DATA REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000FF</resetValue>
                </register>
                <!--CRCCR: CRC CONTROL REGISTER-->
                <register>
                    <name>CRCCR</name>
                    <description>CRC CONTROL REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--CRCSEL-->
                        <field>
                            <name>CRCSEL</name>
                            <description>MODE SELECT</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CRC16</name>
                                    <description>CRC16</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRC8</name>
                                    <description>CRC8</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCITT</name>
                                    <description>CCITT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCITT</name>
                                    <description>CCITT</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--XOR-->
                        <field>
                            <name>XOR</name>
                            <description>OUTPUT XOR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--BUSY-->
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--RES-->
                        <field>
                            <name>RES</name>
                            <description>result is zero</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--RFLTO-->
                        <field>
                            <name>RFLTO</name>
                            <description>output reverse</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RFLTIN-->
                        <field>
                            <name>RFLTIN</name>
                            <description>input reverse</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                    <access>read-write</access>
                </register>
                <!--CRCLFSR: CRC LFSR REGISTER-->
                <register>
                    <name>CRCLFSR</name>
                    <description>CRC LFSR REGISTER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LFSR-->
                        <field>
                            <name>LFSR</name>
                            <description>LFSR</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRCXOR: CRC XOR REGISTER-->
                <register>
                    <name>CRC_XOR</name>
                    <description>CRC XOR REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCXOR-->
                        <field>
                            <name>CRCXOR</name>
                            <description>CRC XOR</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--FLSCRCEN:FLASH CRC ENABLE-->
                <register>
                    <name>FLSCRCEN</name>
                    <description>FLASH CRC ENABLE</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FLSCRCEN-->
                        <field>
                            <name>FLSCRCEN</name>
                            <description>FLASH CRC ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRCFLSAD:FLASH CRC ADDR-->
                <register>
                    <name>CRCFLSAD</name>
                    <description>FLASH CRC ADDR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FLSAD-->
                        <field>
                            <name>FLSAD</name>
                            <description>FLASH CRC ADDR</description>
                            <bitRange>[16:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRCFLSSIZE: FLASH CRC SIZE-->
                <register>
                    <name>CRCFLSSIZE</name>
                    <description>FLASH CRC SIZE</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FLSS-->
                        <field>
                            <name>FLSS</name>
                            <description>SIZE = (FLSS+1)*4</description>
                            <bitRange>[16:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
