zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--DISP-->
        <peripheral>
            <name>DISP</name>
            <description>DISP Registers</description>
            <groupName>DISP</groupName>
            <baseAddress>0x40010C00</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DISP</name>
                <value>18</value>
            </interrupt>
            <registers>
                <!--DISPCTRL: DISPLAY CONTROL REGISTER-->
                <register>
                    <name>DISPCTRL</name>
                    <description>GPIO EXTI Select 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DISPMD-->
                        <field>
                            <name>DISPMD</name>
                            <description>DISP MODE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>NORMAL MODE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TEST</name>
                                    <description>TEST MODE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TEST-->
                        <field>
                            <name>TEST</name>
                            <description>OUTPUT MODE AT TEST</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OFF</name>
                                    <description>OFF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ON</name>
                                    <description>ON</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FLICK-->
                        <field>
                            <name>FLICK</name>
                            <description>FLICK ENABLE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--LCDEN-->
                        <field>
                            <name>LCDEN</name>
                            <description>lcd enable</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--ANTIPOLAR-->
                        <field>
                            <name>ANTIPOLAR</name>
                            <description>COM &amp; SEG C0ONNECT TO GND OR FLOATING AT DISP DISABLE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FLOATING</name>
                                    <description>FLOATING</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GND</name>
                                    <description>GND</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LCDTEST: LCD TEST-->
                <register>
                    <name>LCDTEST</name>
                    <description>LCD TEST</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TESTEN-->
                        <field>
                            <name>TESTEN</name>
                            <description>EXTI1[0] input pin select</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--LCCTRL-->
                        <field>
                            <name>LCCTRL</name>
                            <description>TEST CONTROL</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--DF: DIVIDED FREQ-->
                <register>
                    <name>DF</name>
                    <description>DIVIDED FREQ</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DF-->
                        <field>
                            <name>DF</name>
                            <description>DIVIDED FREQ</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
