zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--DISPDATA3: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA3</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA4: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA4</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA5: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA5</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA6: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA6</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA7: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA7</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA8: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA8</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--DISPDATA9: DISPLAY DATA REGISTER 0-9-->
                <register>
                    <name>DISPDATA9</name>
                    <description>DISPLAY DATA REGISTER</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--LCDBIAS: LCD BIAS SETTING-->
                <register>
                    <name>LCDBIAS</name>
                    <description>LCD BIAS SETTING</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000E</resetValue>
                    <fields>
                        <!--LCD BIAS SETTING-->
                        <field>
                            <name>LCDBIAS</name>
                            <description>LCDBIAS</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--COM_EN: COM ENABLE-->
                <register>
                    <name>COM_EN</name>
                    <description>COM ENABLE</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--COMEN 0-3-->
                        <field>
                            <name>COMEN</name>
                            <description>COMEN 0-3</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SEG_EN0: SEG ENABLE 0-->
                <register>
                    <name>SEG_EN0</name>
                    <description>SEG ENABLE</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SEGEN-->
                        <field>
                            <name>SEGEN</name>
                            <description>SEGEN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SEG_EN1: SEG ENABLE 1-->
                <register>
                    <name>SEG_EN1</name>
                    <description>SEG ENABLE</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SEGEN-->
                        <field>
                            <name>SEGEN</name>
                            <description>SEGEN</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
