zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--RTC-->
        <peripheral>
            <name>RTC</name>
            <description>RTC Registers</description>
            <groupName>RTC</groupName>
            <baseAddress>0x40011000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTC</name>
                <value>2</value>
            </interrupt>
            <registers>
                <!--RTCWE: RTC WRITE PROTECT REGISTER-->
                <register>
                    <name>RTCWE</name>
                    <description>RTC WRITE PROTECT REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RTCWE-->
                        <field>
                            <name>RTCWE</name>
                            <description>RTCWE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--RTCIE: RTC IE-->
                <register>
                    <name>RTCIE</name>
                    <description>RTC IE</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--DATE_IE-->
                        <field>
                            <name>DATE_IE</name>
                            <description>DATE_IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--HOUR_IE-->
                        <field>
                            <name>HOUR_IE</name>
                            <description>HOUR_IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MIN_IE-->
                        <field>
                            <name>MIN_IE</name>
                            <description>MIN_IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SEC_IE-->
                        <field>
                            <name>SEC_IE</name>
                            <description>SEC_IE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--2HZ_IE-->
                        <field>
                            <name>IE_2HZ</name>
                            <description>IE_2HZ</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--4HZ_IE-->
                        <field>
                            <name>IE_4HZ</name>
                            <description>IE_4HZ</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--8HZ_IE-->
                        <field>
                            <name>IE_8HZ</name>
                            <description>IE_8HZ</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--16HZ_IE-->
                        <field>
                            <name>IE_16HZ</name>
                            <description>IE_16HZ</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--64HZ_IE-->
                        <field>
                            <name>IE_64HZ</name>
                            <description>IE_64HZ</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--256HZ_IE-->
                        <field>
                            <name>IE_256HZ</name>
                            <description>IE_256HZ</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--1KHZ_IE-->
                        <field>
                            <name>IE_1KHZ</name>
                            <description>IE_1KHZ</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ALARM_IE-->
                        <field>
                            <name>ALARM_IE</name>
                            <description>ALARM_IE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ADJ_IE-->
                        <field>
                            <name>ADJ_IE</name>
                            <description>ADJ_IE</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                        </field>
                         <!--PB4F_IE-->
                        <field>
                            <name>PB4F_IE</name>
                            <description>PB4F_IE</description>
                            <bitRange>[13:13]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PB4R_IE-->
                        <field>
                            <name>PB4R_IE</name>
                            <description>PB4R_IE</description>
                            <bitRange>[14:14]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PB5F_IE-->
                        <field>
                            <name>PB5F_IE</name>
                            <description>PB5F_IE</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PB5R_IE-->
                        <field>
                            <name>PB5R_IE</name>
                            <description>PB5R_IE</description>
                            <bitRange>[16:16]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
