zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--AUTOCAL: AUTO CAL ENABLE register -->
                <register>
                    <name>AUTOCAL</name>
                    <description>AUTO CAL ENABLE register </description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ACALEN-->
                        <field>
                            <name>ACALEN</name>
                            <description>AUTO CAL ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ADOFFSET: AUTO CAL OFFSET register -->
                <register>
                    <name>ADOFFSET</name>
                    <description>AUTO CAL OFFSET register </description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADOFFSET-->
                        <field>
                            <name>ADOFFSET</name>
                            <description>AUTO CAL OFFSET</description>
                            <bitRange>[10:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CALSTEP: AUTO CAL STEP register -->
                <register>
                    <name>CALSTEP</name>
                    <description>AUTO CAL STEP register </description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CALSTEP-->
                        <field>
                            <name>CALSTEP</name>
                            <description>AUTO CAL STEP</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0_238ppm</name>
                                    <description>0_238ppm</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0_119ppm</name>
                                    <description>0_119ppm</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--AUCALBUSY: AUTO CAL BUSY register -->
                <register>
                    <name>AUCALBUSY</name>
                    <description>AUTO CAL BUSY register </description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AUCALBUSY-->
                        <field>
                            <name>AUCALBUSY</name>
                            <description>AUTO CAL BUSY</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ADJCNT: AUTO CAL CIRCLE COUNT register -->
                <register>
                    <name>ADJCNT</name>
                    <description>AUTO CAL CIRCLE COUNT register </description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADJCNT-->
                        <field>
                            <name>ADJCNT</name>
                            <description>AUTO CAL CIRCLE COUNT register </description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AUADJUST: AUTO CAL DATA register -->
                <register>
                    <name>AUADJUST</name>
                    <description>AUTO CAL DATA register </description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AUADJUST-->
                        <field>
                            <name>AUADJUST</name>
                            <description>AUTO CAL DATA</description>
                            <bitRange>[12:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--IWDT-->
        <peripheral>
            <name>IWDT</name>
            <description>IWDT</description>
            <groupName>IWDT</groupName>
            <baseAddress>0x40011400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--IWDTSERV: IWDT SERVER-->
                <register>
                    <name>IWDTSERV</name>
                    <description>IWDT SERVER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                </register>
