zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--IWDTCFG: IWDT CONFIG REGISTER-->
                <register>
                    <name>IWDTCFG</name>
                    <description>IWDT CONFIG REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IWDTOVP-->
                        <field>
                            <name>IWDTOVP</name>
                            <description>IWDT overflow period setting</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>125MS</name>
                                    <description>125MS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>500MS</name>
                                    <description>500MS</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2S</name>
                                    <description>2S</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8S</name>
                                    <description>8S</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--IWDTCNT: iwdt counter register-->
                <register>
                    <name>IWDTCNT</name>
                    <description>iwdt counter register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IWDTCNT-->
                        <field>
                            <name>IWDTCNT</name>
                            <description>IWDTCNT counter</description>
                            <bitRange>[17:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--WWDT-->
        <peripheral>
            <name>WWDT</name>
            <description>WWDT Registers</description>
            <groupName>WWDT</groupName>
            <baseAddress>0x40011800</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDT</name>
                <value>0</value>
            </interrupt>
            <registers>
                <!--WWDTCON: WWDT CONTROL REGISTER-->
                <register>
                    <name>WWDTCON</name>
                    <description>WWDT CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                </register>
                <!--WWDTCFG: WWDT CONFIG REGISTER-->
                <register>
                    <name>WWDTCFG</name>
                    <description>WWDT CONFIG REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WWDT_CFG-->
                        <field>
                            <name>WWDT_CFG</name>
                            <description>WWDT CONFIG</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1T</name>
                                    <description>TPCLK*4096*1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4T</name>
                                    <description>TPCLK*4096*4</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16T</name>
                                    <description>TPCLK*4096*16</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>64T</name>
                                    <description>TPCLK*4096*64</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>128T</name>
                                    <description>TPCLK*4096*128</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256T</name>
                                    <description>TPCLK*4096*256</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>512T</name>
                                    <description>TPCLK*4096*512</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1024T</name>
                                    <description>TPCLK*4096*1024</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
