zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--WWDTCNT: WWDT COUNTER REGISTER-->
                <register>
                    <name>WWDTCNT</name>
                    <description>WWDT COUNTER REGISTER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WWDTCNT-->
                        <field>
                            <name>WWDTCNT</name>
                            <description>WWDT COUNTER</description>
                            <bitRange>[9:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--WWDTIE: WWDT IE-->
                <register>
                    <name>WWDTIE</name>
                    <description>WWDT IE</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WWDTIE-->
                        <field>
                            <name>WWDTIE</name>
                            <description>WWDT IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--WWDTIF: WWDT IF-->
                <register>
                    <name>WWDTIF</name>
                    <description>WWDT IF</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--WWDTIF-->
                        <field>
                            <name>WWDTIF</name>
                            <description>WWDT IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--U7816_0-->
        <peripheral>
            <name>U7816_0</name>
            <description>U7816_0 Registers</description>
            <groupName>U7816</groupName>
            <baseAddress>0x40011C00</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x02C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>U7816_0</name>
                <value>15</value>
            </interrupt>
            <registers>
                <!--U7816CTRL: U7816 CONTROL REGISTER-->
                <register>
                    <name>U7816CTRL</name>
                    <description>U7816 CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--HPUEN-->
                        <field>
                            <name>HPUEN</name>
                            <description>PULLUP ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>PULLUP DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>PULLUP ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--HPUAT-->
                        <field>
                            <name>HPUAT</name>
                            <description>AUTO PULLUP ENABLE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>AUTO PULLUP DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>AUTO PULLUP ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CKOEN-->
                        <field>
                            <name>CKOEN</name>
                            <description>CLK OUTPUT ENABLE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CKO_DIS</name>
                                    <description>CLK OUPUT DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CKO_EN</name>
                                    <description>CLK OUTPUT ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXEN-->
                        <field>
                            <name>RXEN</name>
                            <description>RX ENABLE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RX_DIS</name>
                                    <description>RX DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RX_EN</name>
                                    <description>RX ENABLE </description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXEN-->
                        <field>
                            <name>TXEN</name>
                            <description>TX ENABLE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TX_DIS</name>
                                    <description>TX DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TX_EN</name>
                                    <description>TX ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
