zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--U7816TXBUF: U7816 TX BUF -->
                <register>
                    <name>U7816TXBUF</name>
                    <description>U7816 TX BUF</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXBUF-->
                        <field>
                            <name>TXBUF</name>
                            <description>TX BUF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816IE: U7816 IE-->
                <register>
                    <name>U7816IE</name>
                    <description>U7816 IE</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LSIE-->
                        <field>
                            <name>LSIE</name>
                            <description>FOR ERROR_FLAG</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE-->
                        <field>
                            <name>TXIE</name>
                            <description>TX IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE-->
                        <field>
                            <name>RXIE</name>
                            <description>RX IE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816IF: U7816 IF-->
                <register>
                    <name>U7816IF</name>
                    <description>U7816 IF</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXIF-->
                        <field>
                            <name>RXIF</name>
                            <description>RX IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF-->
                        <field>
                            <name>TXIF</name>
                            <description>TX IF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ERRIF-->
                        <field>
                            <name>ERRIF</name>
                            <description>ERR IF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816ERR: U7816 ERR FLAG REGISTER-->
                <register>
                    <name>U7816ERR</name>
                    <description>U7816 ERR FLAG REGISTER</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OVERR-->
                        <field>
                            <name>OVERR</name>
                            <description>OVerflow ERROR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--FRERR-->
                        <field>
                            <name>FRERR</name>
                            <description>FRAME ERROR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RPARERR-->
                        <field>
                            <name>RPARERR</name>
                            <description>RX PARITY ERROR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TPARERR-->
                        <field>
                            <name>TPARERR</name>
                            <description>TX PARITY ERROR</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--U7816STA: U7816 STATUS REGISTER-->
                <register>
                    <name>U7816STA</name>
                    <description>U7816 STATUS REGISTER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXBUSY-->
                        <field>
                            <name>RXBUSY</name>
                            <description>RX BUSY</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXBUSY-->
                        <field>
                            <name>TXBUSY</name>
                            <description>TX BUSY</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--WAIT_RPT-->
                        <field>
                            <name>WAIT_RPT</name>
                            <description>WAIT_RPT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
