zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--U7816_1-->
        <peripheral derivedFrom="U7816_0">
            <name>U7816_1</name>
            <baseAddress>0x40011C2C</baseAddress>
            <interrupt>
                <name>U7816_1</name>
                <value>16</value>
            </interrupt>
        </peripheral>
        <!--UART COMMON-->
        <peripheral>
            <name>UART_COMMON</name>
            <description>UART_COMMON Registers</description>
            <groupName>UART_COMMON</groupName>
            <baseAddress>0x40012000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x00C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--UARTIE: UART IE-->
                <register>
                    <name>UARTIE</name>
                    <description>UART IE</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXIE0-->
                        <field>
                            <name>TXIE0</name>
                            <description>TXIE0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE0-->
                        <field>
                            <name>RXIE0</name>
                            <description>RXIE0</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE1-->
                        <field>
                            <name>TXIE1</name>
                            <description>TXIE1</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE1-->
                        <field>
                            <name>RXIE1</name>
                            <description>RXIE1</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE2-->
                        <field>
                            <name>TXIE2</name>
                            <description>TXIE2</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE2-->
                        <field>
                            <name>RXIE2</name>
                            <description>RXIE2</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE3-->
                        <field>
                            <name>TXIE3</name>
                            <description>TXIE3</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE3-->
                        <field>
                            <name>RXIE3</name>
                            <description>RXIE3</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE4-->
                        <field>
                            <name>TXIE4</name>
                            <description>TXIE4</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE4-->
                        <field>
                            <name>RXIE4</name>
                            <description>RXIE4</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIE5-->
                        <field>
                            <name>TXIE5</name>
                            <description>TXIE5</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIE5-->
                        <field>
                            <name>RXIE5</name>
                            <description>RXIE5</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--UARTIF: UART IF-->
                <register>
                    <name>UARTIF</name>
                    <description>UARTIF</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXIF0-->
                        <field>
                            <name>TXIF0</name>
                            <description>TXIF0</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIF0-->
                        <field>
                            <name>RXIF0</name>
                            <description>RXIF0</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF1-->
                        <field>
                            <name>TXIF1</name>
                            <description>TXIF1</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIF1-->
                        <field>
                            <name>RXIF1</name>
                            <description>RXIF1</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF2-->
                        <field>
                            <name>TXIF2</name>
                            <description>TXIF2</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIF2-->
                        <field>
                            <name>RXIF2</name>
                            <description>RXIF2</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF3-->
                        <field>
                            <name>TXIF3</name>
                            <description>TXIF3</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIF3-->
                        <field>
                            <name>RXIF3</name>
                            <description>RXIF3</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF4-->
                        <field>
                            <name>TXIF4</name>
                            <description>TXIF4</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIF4-->
                        <field>
                            <name>RXIF4</name>
                            <description>RXIF4</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF5-->
                        <field>
                            <name>TXIF5</name>
                            <description>TXIF5</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXIF5-->
                        <field>
                            <name>RXIF5</name>
                            <description>RXIF5</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--IRCON: IR CONFIG-->
                <register>
                    <name>IRCON</name>
                    <description>IR CONFIG</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000D2</resetValue>
                    <fields>
                        <!--TZBRG-->
                        <field>
                            <name>TZBRG</name>
                            <description>FIR = Fpclk / (TZBRG +1) </description>
                            <bitRange>[10:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TH-->
                        <field>
                            <name>TH</name>
                            <description>duty cuycle Y = (TZBRG[10:4] * TH) /(TZBRG+1)</description>
                            <bitRange>[14:11]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IRFLAG-->
                        <field>
                            <name>IRFLAG</name>
                            <description>IRFLAG</description>
                            <bitRange>[15:15]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
