zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--UART0-->
        <peripheral>
            <name>UART0</name>
            <description>UART0 Registers</description>
            <groupName>UART</groupName>
            <baseAddress>0x4001200C</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>UART0</name>
                <value>9</value>
            </interrupt>
            <registers>
                <!--RXSTAx:RX STATUS-->
                <register>
                    <name>RXSTAx</name>
                    <description>RX STATUS</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RX9D-->
                        <field>
                            <name>RX9D</name>
                            <description>RX BIT9</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--OERR-->
                        <field>
                            <name>OERR</name>
                            <description>Overflow ERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--FERR-->
                        <field>
                            <name>FERR</name>
                            <description>Frame ERR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PERR-->
                        <field>
                            <name>PERR</name>
                            <description>Parity ERR</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXEN-->
                        <field>
                            <name>RXEN</name>
                            <description>RX ENABLE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ERRIE-->
                        <field>
                            <name>ERRIE</name>
                            <description>ERR IE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PDSEL-->
                        <field>
                            <name>PDSEL</name>
                            <description>PARITY MODE SELECT</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8NONE</name>
                                    <description>8BIT,NO PARITY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8EVEN</name>
                                    <description>8BIT,EVEN PARITY</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8ODD</name>
                                    <description>8BIT,ODD PARITY</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>9NONE</name>
                                    <description>9BIT,NO PARITY</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--TXSTAx: TX STATUS-->
                <register>
                    <name>TXSTAx</name>
                    <description>TX STATUS</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--TX9D-->
                        <field>
                            <name>TX9D</name>
                            <description>TX bit9</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--IREN-->
                        <field>
                            <name>IREN</name>
                            <description>IR ENable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXEN-->
                        <field>
                            <name>TXEN</name>
                            <description>TX ENable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIS-->
                        <field>
                            <name>TXIS</name>
                            <description>TX Interupt Select</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TXBUF</name>
                                    <description>INT AT TXBUF EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSR</name>
                                    <description>INT AT TSR EMPTY</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--STOPSEL-->
                        <field>
                            <name>STOPSEL</name>
                            <description>STOP BIT select</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1BIT</name>
                                    <description>1 STOPBIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2BIT</name>
                                    <description>2 STOPBIT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--RXREGx: RX REGx-->
                <register>
                    <name>RXREGx</name>
                    <description>RX REGx</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXREG-->
                        <field>
                            <name>RXREGx</name>
                            <description>RX REGx</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--TXREGx: TX REGx-->
                <register>
                    <name>TXREGx</name>
                    <description>TX REGx</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXREG-->
                        <field>
                            <name>TXREG</name>
                            <description>TX REG</description>
                            <bitRange>[7:0]</bitRange>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!--SPBRG: baudrate setting register-->
                <register>
                    <name>SPBRG</name>
                    <description>baudrate setting register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000341</resetValue>
                    <fields>
                        <!--SPBRG-->
                        <field>
                            <name>SPBRG</name>
                            <description>Baud = FAPBCLK / (SPBRG+1)</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--TXBUFSTAx: TX BUF STAtus-->
                <register>
                    <name>TXBUFSTAx</name>
                    <description>TX BUF STAtus</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--TXFF-->
                        <field>
                            <name>TXFF</name>
                            <description>TX buff Full Flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FULL</name>
                                    <description>FULL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TX_INTSEL-->
                        <field>
                            <name>TX_INTSEL</name>
                            <description>TX_INTSEL</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TXIS</name>
                                    <description>TXIS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSF</name>
                                    <description>TSF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TBUF</name>
                                    <description>TBUF</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NONE</name>
                                    <description>NONE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
