zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--I2CERR: I2C ERR-->
                <register>
                    <name>I2CERR</name>
                    <description>I2C ERR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--IERR-->
                        <field>
                            <name>IERR</name>
                            <description>IDLE ERR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SDERR-->
                        <field>
                            <name>SDERR</name>
                            <description>START_DONE ERR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OIERR-->
                        <field>
                            <name>OIERR</name>
                            <description>OP_IDLE ERR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ERRIE-->
                        <field>
                            <name>ERRIE</name>
                            <description>ERR IE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--ANAC-->
        <peripheral>
            <name>ANAC</name>
            <description>ANAC Registers</description>
            <groupName>ANAC</groupName>
            <baseAddress>0x40012800</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x080</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SVD</name>
                <value>1</value>
            </interrupt>
            <interrupt>
                <name>FDET</name>
                <value>4</value>
            </interrupt>
            <interrupt>
                <name>ADC</name>
                <value>5</value>
            </interrupt>
            <interrupt>
                <name>TRNG</name>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>COMP</name>
                <value>23</value>
            </interrupt>
            <registers>
                <!--PDRCFG: PDR CONFIG-->
                <register>
                    <name>PDRCFG</name>
                    <description>PDR CONFIG REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <!--PDREN-->
                        <field>
                            <name>PDREN</name>
                            <description>PDR ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PDRCFG-->
                        <field>
                            <name>PDRCFG</name>
                            <description>PDR CONFIG</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1.5V</name>
                                    <description>1.5V</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.25V</name>
                                    <description>1.25V</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.35V</name>
                                    <description>1.35V</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.4V</name>
                                    <description>1.4V</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--BORCFG: BOR CONFIG-->
                <register>
                    <name>BORCFG</name>
                    <description>BOR CONFIG</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <fields>
                        <!--OFF_BOR-->
                        <field>
                            <name>OFF_BOR</name>
                            <description>OFF_BOR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--BOR_PDRCFG-->
                        <field>
                            <name>BOR_PDRCFG</name>
                            <description>BOR_PDR CONFIG</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1.7V</name>
                                    <description>1.7V</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.6V</name>
                                    <description>1.6V</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.65V</name>
                                    <description>1.65V</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1.75V</name>
                                    <description>1.75V</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LDO15CON: LDO15 CONTROL REGISTER-->
                <register>
                    <name>LDO15CON</name>
                    <description>LDO15 CONTROL REGISTER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000007</resetValue>
                    <fields>
                        <!--TRIM_LDO15-->
                        <field>
                            <name>TRIM_LDO15</name>
                            <description>LDO15 TRIM DATA</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--VREFTRIM: VREF TRIM REGISTER-->
                <register>
                    <name>VREFTRIM</name>
                    <description>VREF TRIM REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000001A</resetValue>
                    <fields>
                        <!--VREFTRIM-->
                        <field>
                            <name>VREFTRIM</name>
                            <description>VREF TRIM DATA</description>
                            <bitRange>[5:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ULPRCON: ULPLDO CONFIG REGISTER-->
                <register>
                    <name>ULPRCON</name>
                    <description>ULP CONFIG REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000047</resetValue>
                    <fields>
                        <!--ULPRHV-->
                        <field>
                            <name>ULPRHV</name>
                            <description>ULPLDO HIGH VOLTAGE OUTPUT</description>
                            <bitRange>[3:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ULPRLV-->
                        <field>
                            <name>ULPRLV</name>
                            <description>ULPLDO LOW VOLTAGE OUTPUT</description>
                            <bitRange>[7:4]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SVDCFG: SVD CONFIG REGISTER-->
                <register>
                    <name>SVDCFG</name>
                    <description>SVD CONFIG REGISTER</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000208</resetValue>
                    <fields>
                        <!--SVDITVL-->
                        <field>
                            <name>SVDITVL</name>
                            <description>SVD Interval</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>15.625ms</name>
                                    <description>15.625ms</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>62.5ms</name>
                                    <description>62.5ms</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>256ms</name>
                                    <description>256ms</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1s</name>
                                    <description>1s</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SVDMOD-->
                        <field>
                            <name>SVDMOD</name>
                            <description>SVD MODE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMTEN</name>
                                    <description>INTERMITTENT ENABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OFTEN</name>
                                    <description>OFTEN ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DFEN-->
                        <field>
                            <name>DFEN</name>
                            <description>SVD DIGITAL FILTER ENABLE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SVDLVL-->
                        <field>
                            <name>SVDLVL</name>
                            <description>SVD ALARM LEVEL</description>
                            <bitRange>[7:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PRIE-->
                        <field>
                            <name>PRIE</name>
                            <description>Power Restore Interrupt Enable</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PFIE-->
                        <field>
                            <name>PFIE</name>
                            <description>Power Fail Interrupt Enable</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SVDCON: SVD CONTROL REGISTER-->
                <register>
                    <name>SVDCON</name>
                    <description>SVD CONTROL REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--SVDEN-->
                        <field>
                            <name>SVDEN</name>
                            <description>SVD ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SVDTE-->
                        <field>
                            <name>SVDTE</name>
                            <description>SVD TEST EENABLE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--SVDSIF: SVD STATUS AND IF-->
                <register>
                    <name>SVDSIF</name>
                    <description>SVD STATUS AND IF</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PRF-->
                        <field>
                            <name>PRF</name>
                            <description>PRF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PFF-->
                        <field>
                            <name>PFF</name>
                            <description>PFF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--SVDR-->
                        <field>
                            <name>SVDR</name>
                            <description>SVD OUTPUT LATCH</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-only</access>
                        </field>
                        <!--SVDO-->
                        <field>
                            <name>SVDO</name>
                            <description>SVD OUTPUT</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--FDETIE: XTLF FREQ DETECT IE-->
                <register>
                    <name>FDETIE</name>
                    <description>XTLF FREQ DETECT IE</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LFDET_IE-->
                        <field>
                            <name>LFDET_IE</name>
                            <description>XTLF FREQ DETECT IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--FDETIF: XTLF FREQ DETECT IF-->
                <register>
                    <name>FDETIF</name>
                    <description>XTLF FREQ DETECT IF</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--FDET_IF-->
                        <field>
                            <name>FDET_IF</name>
                            <description>FDET_IF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--FDET_OUT_B-->
                        <field>
                            <name>FDET_OUT_B</name>
                            <description>FDET_OUT_B</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
