zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--ADCCON: ADC CONTROL REGISTER-->
                <register>
                    <name>ADCCON</name>
                    <description>ADC CONTROL REGISTER</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADC_EN-->
                        <field>
                            <name>ADC_EN</name>
                            <description>ADC ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ADC_VANA_EN-->
                        <field>
                            <name>ADC_VANA_EN</name>
                            <description>ADC OUTER VOLTAGE TEST ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ADC_IE-->
                        <field>
                            <name>ADC_IE</name>
                            <description>ADC_IE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ADCTRIM: ADC TRIM REGISTER-->
                <register>
                    <name>ADCTRIM</name>
                    <description>ADC TRIM REGISTER</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADC_TRIM-->
                        <field>
                            <name>ADC_TRIM</name>
                            <description>ADC_TRIM</description>
                            <bitRange>[10:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ADCDATA: ADC DATA REGISTER-->
                <register>
                    <name>ADCDATA</name>
                    <description>ADC DATA REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADC_DATA-->
                        <field>
                            <name>ADC_DATA</name>
                            <description>ADC_DATA</description>
                            <bitRange>[10:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ADCIF: ADC IF REGISTER-->
                <register>
                    <name>ADCIF</name>
                    <description>ADC IF REGISTER</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ADC_IF-->
                        <field>
                            <name>ADC_IF</name>
                            <description>ADC IF,write 1 to clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                         <!--ADC_DONE-->
                        <field>
                            <name>ADC_DONE</name>
                            <description>ADC_DONE IF,disable ADC to clear</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!--TRNGCON: TRNG CONTROL REGISTER-->
                <register>
                    <name>TRNGCON</name>
                    <description>TRNG CONTROL REGISTER</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RNGEN-->
                        <field>
                            <name>RNGEN</name>
                            <description>RNGEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--COMP1CR: COMP1 CONTROL REGISTER-->
                <register>
                    <name>COMP1CR</name>
                    <description>COMP1 CONTROL REGISTER</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CMP1EN-->
                        <field>
                            <name>CMP1EN</name>
                            <description>CMP1EN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--V1NSEL-->
                        <field>
                            <name>V1NSEL</name>
                            <description>V1NSEL</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PF5</name>
                                    <description>PF5</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF1</name>
                                    <description>PF1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Vref 0.8V</name>
                                    <description>Vref 0.8V</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Vref/2 0.4V</name>
                                    <description>Vref/2 0.4V</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--V1PSEL-->
                        <field>
                            <name>V1PSEL</name>
                            <description>V1PSEL</description>
                            <bitRange>[4:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PF6</name>
                                    <description>PF6</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PF2</name>
                                    <description>PF2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PG2</name>
                                    <description>PG2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PG3</name>
                                    <description>PG3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CMP1O-->
                        <field>
                            <name>CMP1O</name>
                            <description>CMP1 OUTPUT</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
