zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--COMP2CR: COMP2 CONTROL REGISTER-->
                <register>
                    <name>COMP2CR</name>
                    <description>COMP2 CONTROL REGISTER</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CMP2EN-->
                        <field>
                            <name>CMP2EN</name>
                            <description>CMP2 ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--V2NSEL-->
                        <field>
                            <name>V2NSEL</name>
                            <description>V2NSEL</description>
                            <bitRange>[2:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC14</name>
                                    <description>PC14</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PE3</name>
                                    <description>PE3</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Vref 0.8V</name>
                                    <description>Vref 0.8V</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Vref/2 0.4V</name>
                                    <description>Vref/2 0.4V</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--V2PSEL-->
                        <field>
                            <name>V2PSEL</name>
                            <description>V2PSEL</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PC15</name>
                                    <description>PC15</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PE4</name>
                                    <description>PE4</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CMP2O-->
                        <field>
                            <name>CMP2O</name>
                            <description>CMP2 OUTPUT</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--COMPICR: COMP INT CONFIG REGISTER-->
                <register>
                    <name>COMPICR</name>
                    <description>COMP INT CONFIG REGISTER</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CMP1IE-->
                        <field>
                            <name>CMP1IE</name>
                            <description>CMP1IE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMP2IE-->
                        <field>
                            <name>CMP2IE</name>
                            <description>CMP2IE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMP1SEL-->
                        <field>
                            <name>CMP1SEL</name>
                            <description>CMP1 INT SOURCE SELECT</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMP2SEL-->
                        <field>
                            <name>CMP2SEL</name>
                            <description>CMP2 INT SOURCE SELECT</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                        </field>
                          <!--BUFENB-->
                        <field>
                            <name>BUFENB</name>
                            <description>BUFENB</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--BUFBYP-->
                        <field>
                            <name>BUFBYP</name>
                            <description>BUFBYP</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMP1DF-->
                        <field>
                            <name>CMP1DF</name>
                            <description>CMP1DF</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMP2DF-->
                        <field>
                            <name>CMP2DF</name>
                            <description>CMP2DF</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--COMPIF: COMP IF REGISTER-->
                <register>
                    <name>COMPIF</name>
                    <description>COMP IF REGISTER</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CMP1IF-->
                        <field>
                            <name>CMP1IF</name>
                            <description>CMP1IF, WRITE 1 TO CLEAR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMP2IF-->
                        <field>
                            <name>CMP2IF</name>
                            <description>CMP2IF,WRITE 1 TO CLEAR</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
