zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--BTxCFG2: BTIMER CONFIG REGISTER 2-->
                <register>
                    <name>BTxCFG2</name>
                    <description>BTIMER CONFIG REGISTER 2</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--INSEL1-->
                        <field>
                            <name>INSEL1</name>
                            <description>INSEL1</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>UART_RX0</name>
                                    <description>UART_RX0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART_RX1</name>
                                    <description>UART_RX1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART_RX2</name>
                                    <description>UART_RX2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP</name>
                                    <description>RCLP</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--INSEL2-->
                        <field>
                            <name>INSEL2</name>
                            <description>INSEL2</description>
                            <bitRange>[3:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>UART_RX3</name>
                                    <description>UART_RX3</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART_RX4</name>
                                    <description>UART_RX4</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART_RX5</name>
                                    <description>UART_RX5</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP/BT1_OUT</name>
                                    <description>RCLP/BT1_OUT</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXSEL1-->
                        <field>
                            <name>EXSEL1</name>
                            <description>EXSEL1</description>
                            <bitRange>[5:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BT1_IN0</name>
                                    <description>BT1_IN0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BT1_IN1</name>
                                    <description>BT1_IN1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BT1_IN2</name>
                                    <description>BT1_IN2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BT1_IN3</name>
                                    <description>BT1_IN3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EXSEL2-->
                        <field>
                            <name>EXSEL2</name>
                            <description>EXSEL2</description>
                            <bitRange>[7:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BT1_IN0</name>
                                    <description>BT1_IN0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BT1_IN1</name>
                                    <description>BT1_IN1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BT1_IN2</name>
                                    <description>BT1_IN2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BT1_IN3</name>
                                    <description>BT1_IN3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
