zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--BTxPRES: BTIMER PRESCALE REGISTER-->
                <register>
                    <name>BTxPRES</name>
                    <description>BTIMER PRESCALE REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PRESCALE-->
                        <field>
                            <name>PRESCALE</name>
                            <description>PRESCALE</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxLOADCR: BTIMER LOADER CONTROL REGISTER-->
                <register>
                    <name>BTxLOADCR</name>
                    <description>BTIMER LOADER CONTROL REGISTER</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LLEN-->
                        <field>
                            <name>LLEN</name>
                            <description>LOW BYTE LOAD ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--LHEN-->
                        <field>
                            <name>LHEN</name>
                            <description>HIGH BYTE LOAD ENABLE</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxCNTL: BTIMER LOW BYTE COUNTER REGISTER-->
                <register>
                    <name>BTxCNTL</name>
                    <description>BTIMER LOW BYTE COUNTER REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CNTL-->
                        <field>
                            <name>CNTL</name>
                            <description>CNTL</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxCNTH: BTIMER HIGH BYTE COUNTER REGISTER-->
                <register>
                    <name>BTxCNTH</name>
                    <description>BTIMER HIGH BYTE COUNTER REGISTER</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CNTH-->
                        <field>
                            <name>CNTH</name>
                            <description>CNTH</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxPRESET: BTIMER PRESET REGISTER-->
                <register>
                    <name>BTxPRESET</name>
                    <description>BTIMER PRESET REGISTER</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PRESETL-->
                        <field>
                            <name>PRESETL</name>
                            <description>PRESET LOW BYTE</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PRESETH-->
                        <field>
                            <name>PRESETH</name>
                            <description>PRESETH HIGH BYTE</description>
                            <bitRange>[15:8]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxLOADL: BTIMER LOW BYTE LOAD REGISTER-->
                <register>
                    <name>BTxLOADL</name>
                    <description>BTIMER LOW BYTE LOAD REGISTER</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LOADL-->
                        <field>
                            <name>LOADL</name>
                            <description>LOADL</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxLOADH: BTIMER HIGH BYTE LOAD REGISTER-->
                <register>
                    <name>BTxLOADH</name>
                    <description>BTIMER HIGH BYTE LOAD REGISTER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LOADH-->
                        <field>
                            <name>LOADH</name>
                            <description>LOADH</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
