zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--BTxIE: BTIMER IE REGISTER-->
                <register>
                    <name>BTxIE</name>
                    <description>BTIMER IE REGISTER</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CAPIE-->
                        <field>
                            <name>CAPIE</name>
                            <description>CAPIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OVLIE-->
                        <field>
                            <name>OVLIE</name>
                            <description>OVLIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OVHIE-->
                        <field>
                            <name>OVHIE</name>
                            <description>OVHIE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPLIE-->
                        <field>
                            <name>CMPLIE</name>
                            <description>CMPLIE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPHIE-->
                        <field>
                            <name>CMPHIE</name>
                            <description>CMPHIE</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--BTxIF: BTIMER IF REGISTER-->
                <register>
                    <name>BTxIF</name>
                    <description>BTIMER IF REGISTER</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CAPIF-->
                        <field>
                            <name>CAPIF</name>
                            <description>CAPIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OVLIF-->
                        <field>
                            <name>OVLIF</name>
                            <description>OVLIF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--OVHIF-->
                        <field>
                            <name>OVHIF</name>
                            <description>OVHIF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPLIF-->
                        <field>
                            <name>CMPLIF</name>
                            <description>CMPLIF</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPHIF-->
                        <field>
                            <name>CMPHIF</name>
                            <description>CMPHIF</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EDGESTA-->
                        <field>
                            <name>EDGESTA</name>
                            <description>EDGESTA</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--BTIMER2-->
        <peripheral derivedFrom="BTIMER1">
            <name>BTIMER2</name>
            <baseAddress>0x40013044</baseAddress>
            <interrupt>
                <name>BTIMER2</name>
                <value>25</value>
            </interrupt>
        </peripheral>
        <!--ETIMER1-->
        <peripheral>
            <name>ETIMER1</name>
            <description>EXTENDED TIMER Registers</description>
            <groupName>ETIMER</groupName>
            <baseAddress>0x40013090</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ETIMER1</name>
                <value>26</value>
            </interrupt>
            <registers>
                <!--ETxCR: ETIMER CONTROL REGISTER-->
                <register>
                    <name>ETxCR</name>
                    <description>ETIMER CONTROL REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CAPEDGE-->
                        <field>
                            <name>CAPEDGE</name>
                            <description>CAPTURE EDGE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CAPONCE-->
                        <field>
                            <name>CAPONCE</name>
                            <description>CAPTURE ONCE </description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CONTINUOUS</name>
                                    <description>CONTINUOUS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ONCE</name>
                                    <description>ONCE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CAPCLR-->
                        <field>
                            <name>CAPCLR</name>
                            <description>CLEAR COUNTER AT CAPTURE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NOCLR</name>
                                    <description>NOCLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CAPMOD-->
                        <field>
                            <name>CAPMOD</name>
                            <description>CAPTURE MODE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PERIOD</name>
                                    <description>PULSE PERIOD</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WIDTH</name>
                                    <description>PULSE WIDTH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--EDGESEL-->
                        <field>
                            <name>EDGESEL</name>
                            <description>EDGE SELECT</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POS</name>
                                    <description>POS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG</name>
                                    <description>NEG</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CASEN-->
                        <field>
                            <name>CASEN</name>
                            <description>Cascade Enable</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--MOD-->
                        <field>
                            <name>MOD</name>
                            <description>MODE</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CNT</name>
                                    <description>CNT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CAP</name>
                                    <description>CAP</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--CEN-->
                        <field>
                            <name>CEN</name>
                            <description>CEN</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PWM-->
                        <field>
                            <name>PWM</name>
                            <description>PWM</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EXFLT-->
                        <field>
                            <name>EXFLT</name>
                            <description>EXFLT</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ETxINSEL: ETIMER INPUT SOURCE SELECT REGISTER-->
                <register>
                    <name>ETxINSEL</name>
                    <description>ETIMER INPUT SOURCE SELECT REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--GRP1SEL-->
                        <field>
                            <name>GRP1SEL</name>
                            <description>GRP1SEL</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>APBCLK</name>
                                    <description>APBCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTLF/XTLF/ET3_IN0/ET4_IN0</name>
                                    <description>XTLF/XTLF/ET3_IN0/ET4_IN0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RCLP/RCLP/RTCSEC/RTC64HZ</name>
                                    <description>RCLP/RCLP/RTCSEC/RTC64HZ</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ET1_IN0/ET4_IN0/RCLP/LPTO</name>
                                    <description>ET1_IN0/ET4_IN0/RCLP/LPTO</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--GRP2SEL-->
                        <field>
                            <name>GRP2SEL</name>
                            <description>GRP2SEL</description>
                            <bitRange>[4:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>UART0_RX/UART2_RX/ET3_IN1/ET4_IN1</name>
                                    <description>UART0_RX/UART2_RX/ET3_IN1/ET4_IN1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UART1_RX/UART3_RX/XTLF/XTLF</name>
                                    <description>UART1_RX/UART3_RX/XTLF/XTLF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>XTLF/XTLF/UART4_RX/UART_RX2</name>
                                    <description>XTLF/XTLF/UART4_RX/UART_RX2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ET1_IN1/ET2_IN1/UART5_RX/UART_RX0</name>
                                    <description>ET1_IN1/ET2_IN1/UART5_RX/UART_RX0</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ET1_IN2/ET2_IN2/RTCSEC/CMP1O</name>
                                    <description>ET1_IN2/ET2_IN2/RTCSEC/CMP1O</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>U7816RX0/U7816RX0/RFU/CMP2O</name>
                                    <description>U7816RX0/U7816RX0/RFU/CMP2O</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMP2O/CMP2O/RFU/RTCSEC</name>
                                    <description>CMP2O/CMP2O/RFU/RTCSEC</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LPTO/LPTO/RFU/LPTO </name>
                                    <description>LPTO/LPTO/RFU/LPTO </description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SIG1SEL-->
                        <field>
                            <name>SIG1SEL</name>
                            <description>SIG1SEL</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Group1</name>
                                    <description>Group1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Group2</name>
                                    <description>Group2</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SIG2SEL-->
                        <field>
                            <name>SIG2SEL</name>
                            <description>SIG2SEL</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Group2</name>
                                    <description>Group2</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Group1</name>
                                    <description>Group1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--ETxPESCALE1: ETIMER PESCALE REGISTER 1-->
                <register>
                    <name>ETxPESCALE1</name>
                    <description>ETIMER PESCALE REGISTER 1</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PRESCALE1-->
                        <field>
                            <name>PRESCALE1</name>
                            <description>PRESCALE for Signal1</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ETxPESCALE2: ETIMER PESCALE REGISTER 2-->
                <register>
                    <name>ETxPESCALE2</name>
                    <description>ETIMER PESCALE REGISTER 2</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--PRESCALE2-->
                        <field>
                            <name>PRESCALE2</name>
                            <description>PRESCALE FOR Signal2</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ETxIVR: ETIMER INIT VALUE REGISTER-->
                <register>
                    <name>ETxIVR</name>
                    <description>ETIMER INIT VALUE REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--INITVALUE-->
                        <field>
                            <name>INITVALUE</name>
                            <description>INITVALUE</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ETxCMP: ETIMER CMP REGISTER-->
                <register>
                    <name>ETxCMP</name>
                    <description>ETIMER CMP REGISTER</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CMP-->
                        <field>
                            <name>CMP</name>
                            <description>CMP</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
