zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--ETxIE: ETIMER IE REGISTER-->
                <register>
                    <name>ETxIE</name>
                    <description>ETIMER IE REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OVIE-->
                        <field>
                            <name>OVIE</name>
                            <description>OVIE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CAPIE-->
                        <field>
                            <name>CAPIE</name>
                            <description>CAPIE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPIE-->
                        <field>
                            <name>CMPIE</name>
                            <description>CMPIE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ETxIF: ETIMER IF REGISTER-->
                <register>
                    <name>ETxIF</name>
                    <description>ETIMER IF REGISTER</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--OVIF-->
                        <field>
                            <name>OVIF</name>
                            <description>OVIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CAPIF-->
                        <field>
                            <name>CAPIF</name>
                            <description>CAPIF</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--EDGESTA-->
                        <field>
                            <name>EDGESTA</name>
                            <description>EDGESTA</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--CMPIF-->
                        <field>
                            <name>CMPIF</name>
                            <description>CMPIF</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--ETIMER2-->
        <peripheral derivedFrom="ETIMER1">
            <name>ETIMER2</name>
            <baseAddress>0x400130B0</baseAddress>
            <interrupt>
                <name>ETIMER2</name>
                <value>27</value>
            </interrupt>
        </peripheral>
        <!--ETIMER3-->
        <peripheral derivedFrom="ETIMER1">
            <name>ETIMER3</name>
            <baseAddress>0x400130D0</baseAddress>
            <interrupt>
                <name>ETIMER3</name>
                <value>28</value>
            </interrupt>
        </peripheral>
        <!--ETIMER4-->
        <peripheral derivedFrom="ETIMER1">
            <name>ETIMER4</name>
            <baseAddress>0x400130F0</baseAddress>
            <interrupt>
                <name>ETIMER4</name>
                <value>29</value>
            </interrupt>
        </peripheral>
        <!--ETxCNT-->
        <peripheral>
            <name>ETxCNT</name>
            <description>EXTENDED TIMER COUNTER Registers</description>
            <groupName>ETIMER</groupName>
            <baseAddress>0x40013110</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <!--ET1CNT: ETIMER1 COUNTER REGISTER-->
                <register>
                    <name>ET1CNT</name>
                    <description>ETIMER1 COUNTER REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ETxCNT-->
                        <field>
                            <name>ETxCNT</name>
                            <description>ETIMER COUNTER</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ET2CNT: ETIMER2 COUNTER REGISTER-->
                <register>
                    <name>ET2CNT</name>
                    <description>ETIMER2 COUNTER REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ETxCNT-->
                        <field>
                            <name>ETxCNT</name>
                            <description>ETIMER COUNTER</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ET3CNT: ETIMER3 COUNTER REGISTER-->
                <register>
                    <name>ET3CNT</name>
                    <description>ETIMER3 COUNTER REGISTER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ETxCNT-->
                        <field>
                            <name>ETxCNT</name>
                            <description>ETIMER COUNTER</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--ET4CNT: ETIMER4 COUNTER REGISTER-->
                <register>
                    <name>ET4CNT</name>
                    <description>ETIMER4 COUNTER REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--ETxCNT-->
                        <field>
                            <name>ETxCNT</name>
                            <description>ETIMER COUNTER</description>
                            <bitRange>[15:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
