zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--AESKEY3: AES KEY3 REGISTER-->
                <register>
                    <name>AESKEY3</name>
                    <description>AES KEY3 REGISTER</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESKEY4: AES KEY4 REGISTER-->
                <register>
                    <name>AESKEY4</name>
                    <description>AES KEY4 REGISTER</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESKEY5: AES KEY5 REGISTER-->
                <register>
                    <name>AESKEY5</name>
                    <description>AES KEY5 REGISTER</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESKEY6: AES KEY6 REGISTER-->
                <register>
                    <name>AESKEY6</name>
                    <description>AES KEY6 REGISTER</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESKEY7: AES KEY7 REGISTER-->
                <register>
                    <name>AESKEY7</name>
                    <description>AES KEY7 REGISTER</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESKEY-->
                        <field>
                            <name>AESKEY</name>
                            <description>AESKEY</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESIVR0: AES INITIAL VECTOR0 REGISTER-->
                <register>
                    <name>AESIVR0</name>
                    <description>AES INITIAL VECTOR0 REGISTER</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESIVR-->
                        <field>
                            <name>AESIVR</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESIVR1: AES INITIAL VECTOR1 REGISTER-->
                <register>
                    <name>AESIVR1</name>
                    <description>AES INITIAL VECTOR1 REGISTER</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESIVR-->
                        <field>
                            <name>AESIVR</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESIVR2: AES INITIAL VECTOR2 REGISTER-->
                <register>
                    <name>AESIVR2</name>
                    <description>AES INITIAL VECTOR2 REGISTER</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESIVR-->
                        <field>
                            <name>AESIVR</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--AESIVR3: AES INITIAL VECTOR3 REGISTER-->
                <register>
                    <name>AESIVR3</name>
                    <description>AES INITIAL VECTOR3 REGISTER</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--AESIVR-->
                        <field>
                            <name>AESIVR</name>
                            <description>AESIVR</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
