zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
            </registers>
        </peripheral>
        <!--TRNG-->
        <peripheral>
            <name>TRNG</name>
            <description>TRNG Registers</description>
            <groupName>TRHG</groupName>
            <baseAddress>0x40013C04</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x020</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TRNG</name>
                <value>22</value>
            </interrupt>
            <registers>
                <!--RNGOUT: TRNG OUTPUT REGISTER-->
                <register>
                    <name>RNGOUT</name>
                    <description>TRNG OUTPUT REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RNGOUT-->
                        <field>
                            <name>RNGOUT</name>
                            <description>RNGOUT</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
               
                <!--RNGIF: TRNG IF REGISTER -->
                <register>
                    <name>RNGIF</name>
                    <description>TRNG IF REGISTER </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RNF-->
                        <field>
                            <name>RNF</name>
                            <description>RNF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--LFSREN-->
                        <field>
                            <name>LFSREN</name>
                            <description>LFSREN</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>              
                <!--CRCCON: CRC CONTROL REGISTER-->
                <register>
                    <name>CRCCON</name>
                    <description>CRC CONTROL REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCEN-->
                        <field>
                            <name>CRCEN</name>
                            <description>CRCEN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--CRCIN: CRC INPUT REGISTER-->
                <register>
                    <name>CRCIN</name>
                    <description>CRC INPUT REGISTER</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCIN-->
                        <field>
                            <name>CRCIN</name>
                            <description>CRCIN</description>
                            <bitRange>[31:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                 <!--CRCIF: CRC complete REGISTER-->
                <register>
                    <name>CRCIF</name>
                    <description>CRC complete REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--CRCIN-->
                        <field>
                            <name>CRCIF</name>
                            <description>CRCIN</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!--LPUART-->
        <peripheral>
            <name>LPUART</name>
            <description>LPUART Registers</description>
            <groupName>LPUART</groupName>
            <baseAddress>0x40010400</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x040</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LPUART</name>
                <value>31</value>
            </interrupt>
            <registers>
                <!--LPURXD: LPUART RECEIVE BUFF REGISTER-->
                <register>
                    <name>LPURXD</name>
                    <description>LPUART RECEIVE BUFF REGISTER</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPURXD-->
                        <field>
                            <name>LPURXD</name>
                            <description>RECEIVED BUFF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPUTXD: LPUART TRANS BUFF REGISTER-->
                <register>
                    <name>LPUTXD</name>
                    <description>LPUART TRANS BUFF REGISTER</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--LPUTXD-->
                        <field>
                            <name>LPUTXD</name>
                            <description>TRANS BUFF</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPUSTA: LPUART STATUS REGISTER-->
                <register>
                    <name>LPUSTA</name>
                    <description>LPUART STATUS REGISTER</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000000C0</resetValue>
                    <fields>
                        <!--MATCH-->
                        <field>
                            <name>MATCH</name>
                            <description>REC DATA MATCH COMPARE REGISTER ,WRITE 1 TO CLEAR</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_MATCH</name>
                                    <description>NOT MATCH WITH COMPARE REGISTER</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MARCH</name>
                                    <description>MARCH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXF-->
                        <field>
                            <name>RXF</name>
                            <description>RX BUFF FULL</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>EMPTY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FULL</name>
                                    <description>FULL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXOV-->
                        <field>
                            <name>RXOV</name>
                            <description>RX BUFF OVERFLOW,WRITE 1 TO CLEAR</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_OVERFLOW</name>
                                    <description>NO_OVERFLOW</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OVERFLOW</name>
                                    <description>OVERFLOW</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--FERR-->
                        <field>
                            <name>FERR</name>
                            <description>FRAME ERROR, WRITE 1 TO CLEAR</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--PERR-->
                        <field>
                            <name>PERR</name>
                            <description>PARITY ERROR,WRITE 1 TO CLEAR</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--START-->
                        <field>
                            <name>START</name>
                            <description>DETECT START Signal,WRITE 1 TO CLEAR</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXE-->
                        <field>
                            <name>TXE</name>
                            <description>TX BUFF EMPTY</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TC-->
                        <field>
                            <name>TC</name>
                            <description>TX COMPLETE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPUCON: LPUART CONFIG REGISTER-->
                <register>
                    <name>LPUCON</name>
                    <description>LPUART CONFIG REGISTER</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <!--RXEV-->
                        <field>
                            <name>RXEV</name>
                            <description>RX INTERUPT SOURCE SELECT</description>
                            <bitRange>[1:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>START</name>
                                    <description>START</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REC</name>
                                    <description>1 BYTE DATA RECEIVED</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPARE</name>
                                    <description>COMPARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXEGFALL</name>
                                    <description>RXEGFALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--RXIE-->
                        <field>
                            <name>RXIE</name>
                            <description>RXIE</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--ERRIE-->
                        <field>
                            <name>ERRIE</name>
                            <description>RECEIVED ERROR IE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXPOL-->
                        <field>
                            <name>RXPOL</name>
                            <description>RECEIVE POLAR</description>
                            <bitRange>[4:4]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_REV</name>
                                    <description>NOT REVERSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV</name>
                                    <description>REVERSE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--DL-->
                        <field>
                            <name>DL</name>
                            <description>DATA LENGTH</description>
                            <bitRange>[5:5]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>8BITS</name>
                                    <description>8BITS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>7BITS</name>
                                    <description>7BITS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--SL-->
                        <field>
                            <name>SL</name>
                            <description>STOP LENGTH</description>
                            <bitRange>[6:6]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1BIT</name>
                                    <description>1BIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2BITS</name>
                                    <description>2BITS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PTYP-->
                        <field>
                            <name>PTYP</name>
                            <description>PARITY TYPE</description>
                            <bitRange>[7:7]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVEN</name>
                                    <description>EVEN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ODD</name>
                                    <description>ODD</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--PAREN-->
                        <field>
                            <name>PAREN</name>
                            <description>PARITY ENABLE</description>
                            <bitRange>[8:8]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--NEDET-->
                        <field>
                            <name>NEDET</name>
                            <description>NEGATIVE EDGE DETECT ENABLE</description>
                            <bitRange>[9:9]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXIE-->
                        <field>
                            <name>TXIE</name>
                            <description>TXIE</description>
                            <bitRange>[10:10]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TCIE-->
                        <field>
                            <name>TCIE</name>
                            <description>TCIE</description>
                            <bitRange>[11:11]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <!--TXPOL-->
                        <field>
                            <name>TXPOL</name>
                            <description>TX POLAR</description>
                            <bitRange>[12:12]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_REV</name>
                                    <description>NOT REVERSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REV</name>
                                    <description>REV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
