zsafly/T12/02 matters/FM33LC0/FM33  IAR config文件 202005019/第一步 config -IAR8.0以上/debugger/FMSH/FM33G0xx.SVD
                <!--LPUIF: LPUART IF REGISTER-->
                <register>
                    <name>LPUIF</name>
                    <description>LPUART IF REGISTER</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXIF-->
                        <field>
                            <name>RXIF</name>
                            <description>RXIF</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--RXNEGIF-->
                        <field>
                            <name>RXNEGIF</name>
                            <description>RX NEGATIVE EDGE DETECTED</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXIF-->
                        <field>
                            <name>TXIF</name>
                            <description>TXIF</description>
                            <bitRange>[2:2]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TCIF-->
                        <field>
                            <name>TCIF</name>
                            <description>TX COMPLETE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--LPUBAUD: LPUART BAUDRATE REGISTER-->
                <register>
                    <name>LPUBAUD</name>
                    <description>LPUART BAUDRATE REGISTER</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--BAUD-->
                        <field>
                            <name>BAUD</name>
                            <description>BAUDRATE SELECT</description>
                            <bitRange>[2:0]</bitRange>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>9600BPS</name>
                                    <description>9600BPS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>4800BPS</name>
                                    <description>4800BPS</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2400BPS</name>
                                    <description>2400BPS</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1200BPS</name>
                                    <description>1200BPS</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>600BPS</name>
                                    <description>600BPS</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>300BPS</name>
                                    <description>300BPS</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>300BPS</name>
                                    <description>300BPS</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>300BPS</name>
                                    <description>300BPS</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <!--LPUEN: LPUART ENABLE REGISTER-->
                <register>
                    <name>LPUEN</name>
                    <description>LPUART ENABLE REGISTER</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--RXEN-->
                        <field>
                            <name>RXEN</name>
                            <description>RX ENABLE</description>
                            <bitRange>[0:0]</bitRange>
                            <access>read-write</access>
                        </field>
                        <!--TXEN-->
                        <field>
                            <name>TXEN</name>
                            <description>TX ENABLE</description>
                            <bitRange>[1:1]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--COMPARE: COMPARE DATA REGISTER-->
                <register>
                    <name>COMPARE</name>
                    <description>COMPARE DATA REGISTER</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--COMPARE-->
                        <field>
                            <name>COMPARE</name>
                            <description>COMPARE</description>
                            <bitRange>[7:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!--MCTL: MODULATION CONTROL REGISTER-->
                <register>
                    <name>MCTL</name>
                    <description>MODULATION CONTROL REGISTER</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <!--MCTL-->
                        <field>
                            <name>MCTL</name>
                            <description>MCTL</description>
                            <bitRange>[11:0]</bitRange>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
